const quiz ={
    data:[
        {
            q:`ما هي الفوائد التي تعود علينا من إقامة / بناء الشبكات`,
            a:"مشاركة الموارد,الامان,التنظيم و المركزية,سهولة الاتصالات"
        },
        {
            q:`ما هي األمور التي يجب ان تأخذها في الاعتبار قبل اختيار الشبكة`,
            a:"حجم المؤسسة و عدد المستخدمين,مستوي األمان,طبيعة عمل المؤسسة,مستوي الدعم اإلداري,الاحتياجات,الميزانية"
        },
        {
            q:"اذكر اهم مكونات و عناصر الشبكات ",
            a:"أجهزة الحاسب, طابعات , كابلات , وصلات , أجهزة مركزية , الروتر , أجهزة المودم"
        },
        {
            q:"اذكر أسماء األجهزة المركزية في هيئة النجمة ",
            a:"Hub,Repeater,Switch,Server,Access Point"
        },
        {
            q:"عرف الطبقات (Layers)",
            a:"تنقسم المشروع بناءا علي اقسامه و مكوناته المنطقيه ذات العلاقه الوظيفيه"
        },
        {
            q:"عرف الشرفات (Tiers)",
            a:"لها علاقه بالوجود الفيزيائي سواء وجدت علي حساب او خوادم"
        },
        {
            q:"ما هوا http",
            a:"بروتوكول نقل نص التشعيبي "
        },
        {
            q:"محركات البحث هي",
            a:"مواقع خدمية الغرض الرئيسي منها هو البحث عن المعلومات او الملفات المطلوبة "
        },
        {
            q:"ملفات تعريف الارتباط ال Cookies هي",
            a:"ملفات يقوم الموقع الالكتروني باستحداثها عند دخولك علي موقع ما"
        },
        {
            q:"من البرامج الخبيثة",
            a:"الدودة ,البرامج التجسسية,احصنة طروادة"
        },
        {
            q:"الفيروسات",
            a:"برنامج من صنع الانسان تستخدم بغرض تدمير البيانات الموجودة علي الجهاز او الحاق الضرر به"
        },
        {
            q:"احصنة طروادة",
            a:"تبدوا كما لو كانت برامج مفيدة لكن في الحقيقة هي  برامج تحتوي علي الفيروسات"
        },
        {
            q:"تعريف الشبكات",
            a:" هي مجموعة من أجهزة الحاسب المتصلة ببعضها  البعض بواسطة نظم ادارة شبكات و بروتوكوالت و مكونات مادية و  تتشارك الموارد و تحقق الاتصالات"
        },
        {
            q:"فوائد الشبكات",
            a:"مشاركة الموارد,الامان,التنظيم و المركزيه,سهوله الاتصالات "
        },
        {
            q:"أنواع شبكات الحاسب",
            a:"النطاق الشخصي ) PAN),الشبكة المحلية ) LAN), الشبكة الداخلية المحدودة ) CAN(,الشبكة المدنية ) MAN),الشبكة الممتدة ) WAN),شبكة التخزين ) SAN),شبكة المؤسسات الخيرية ) EPN)"
        },
        {
            q:"أنواع الشبكات من حيث أسلوب التوصيل",
            a:"شبكة نظير لنظير,شبكة خادم "
        },
        {
            q:" الهيئة المادية للشبكة",
            a:"هيئة نقطة لنقطة,هيئة الناقل, هيئة الحلقة,هيئة النجمة,هيئة الشجرة,هيئة التشبيك,هيئة الهجين"
        },
        {
            q:"الهيئة المنطقية للشبكة",
            a:"تقنية الايثرنت,تقنية إشارة توكن,تقنية ال FDDI,Wireless تقنيه"
        },
        {
            q:"طريقة الوصول في تقنية ال Wireless هي",
            a:"CSMA/CA"
        },
        {
            q:"أنواع الشبكات بحسب التقييم الجغرافي",
            a:"WAN-LAN"
        },
        {
            q:"المكونات المادية للشبكة",
            a:"الكابالت,كروت الشبكة,األجهزة المركزية"
        },
        {
            q:"الكابالت و أنواعها",
            a:"الكابل المحوري,STP,UTP,الالياف الضوئية"
        },
        {
            q:"كارت الشبكة",
            a:"الواجهة او المدخل الموجود في أي جهاز حاسب لربط  بالاجهزة الأخرى بالشبكة"
        },
        {
            q:"األجهزة المركزية",
            a:"الأجهزة التي تحتل مركز الشبكة النجمية و توصل  بها الأجهزة الطرفية"
        },
        {
            q:"ال Routers",
            a:"تقوم هذه األجهزة بتمرير البيانات من شبكة الي  اخري"
        },
        {
            q:"المودم",
            a:" جهاز يسمح للكمبيوتر بارسال و استقبال المعلومات عبر  خطوط الهاتف عند ارسال إشارة يحول الجهاز البيانات الرقمية الي إشارة  صوتية تناظرية و عند الاستقبال يقوم بالعكس"
        },
        {
            q:"يحتوي السويتش علي ذاكرة بها",
            a:"عنوان ال MAC"
        },
        {
            q:"اختصار يعبرعن ازواج الاسالك المجدولة الغير محجبة ",
            a:"UTP"
        },
        {
            q:"الاتصالات في الشبكة الواسعة",
            a:"full and duplex Half duplex"
        },
        {
            q:"المكونات البرمجية للشبكة",
            a:"نظام لربط األجهزة المختلفة ببعضها  البعض لتحقيق اتصال بينها عن طريق ما يعرف بالبروتوكوالت التي توحد  القواعد و المعايير بين األجهزة التي تنتجها الشركات المختلفة "
        },
        {
            q:"طبقات النظام القياسي O",
            a:`(Application ( التطبيقات)
            Presentation (التقديم)<br>
            Session ( الجلسه,النقل)<br>
            الشبكه(Network)<br>
            (ربطالبيانات)Data links<br>
            (الفيزيائيه)(Physical)`
        },
        {
            q:"هي نوع البيانات في طبقة ربط البيانات",
            a:"Frames"
        },
        {
            q:"هو البروتوكول المسئول عن تبادل اسم الموقع بال IP المناظر له",
            a:"DNS"
        },
        {
            q:"هي البروتوكوالت المستخدمة في الطبقة الرابعة",
            a:" UDP / TCP"
        },
        {
            q:"إضافة بيانات الي البيانات الاصلية تسمي",
            a:"encapsulation"
        },
        {
            q:"األجهزة التي تعمل مع أجهزة النظام القياسي",
            a:"Hubs,Wireless access point, Switch,Bridge,NIC,Routers"
        },
        {
            q:"بروتوكوالت الطبقات",
            a:"الطبقات ) 5 و 6 و 7 ( تستخدم: – HTTP – FTP DNS – SMTP,TCP – UDP :تستخدم ( 4 ) ا,الطبقة ) 3 ( تستخدم: I,الطبقة ) 2 و 1 ( تستخدم: LAN – W"
        },
        {
            q:" Model IP/TCP يتكون من 4 طبقات و هما",
            a:"التطبيقات,النقل,الانترنت,ربط البيانات"
        },
        {
            q:"تحديد المسار األفضل للوصول الي الجهاز  المعني و توجيه الحزم عبر هذا المسار الي وجهتها",
            a:"التوجية routing"
        },
        {
            q:"العنونة addressing: نقسم العنونة في شبكات الحاسب المختلفة  الي 4 أنواع",
            a:"Physical,Logical,Port,Specific"
        },
        {
            q:"تستخدم طبقة نقل البيانات ال Address MAC تكتبها علي البيانات قبل ارسالها لتستطيع ارسال البيانات بين األجهزة و  تحدد عنوان المرسل و المستقبل",
            a:"العنونة المادية"
        },
        {
            q:"لكل جهاز في الشبكة عنوان منطقي خاص به و هو  يتكون من bits 4 وفقا لبروتوكل 4V IP و bits 6 وفقا لبروتوكول IP V6",
            a:"العنونة المنطقية"
        },
        {
            q:"اقسام البروتوكوالت حسب الوظيفة",
            a:"بروتوكول التطبيقات,بروتوكول النقل,بروتوكول الشبكة"
        },
        {
            q:"بروتوكول يحدد جهة الاتصال",
            a:"TCP"
        },
        {
            q:"بروتوكول ال يحدد جهة الاتصال",
            a:"IP"
        },
        {
            q:"بروتوكول IP/TCP",
            a:"يسمح للشبكات و الانواع المختلفة من الاجهزة  بالاتصال فيما بينها"
        },
        {
            q:"يقوم بروتوكول ICMP",
            a:"بتصحيح األخطاء اذا قام بروتوكول IP بعنونة البيانات بشكل خاطئ و ارسالها لوجهة غير صحيحة"
        },
        {
            q:"بروتوكوالت تقوم باعداد اتصال مباشر بين األجهزة المتصلة بالشبكة  و تحقق موثوقية عالية لكنها تتسبب في بطئ عمل الشبكة",
            a:"Connection oriented"
        },
        {
            q:"الطبقات",
            a:"تقسيم المشروع بناءا علي اقسامه و مكوناته المنطقية ذات  العالقة الوظيفية"
        },
        {
            q:"الشرفات",
            a:"لها عالقة بالوجود الفيزيائي لهذه الطبقات سواء وجدت  علي حاسبات او خوادم"
        },
        {
            q:" في مرحلة التقديم يتم التعديل في مكونات البناء باستخدام",
            a:"CSS"
        },
        {
            q:"صفحة الويب يتم الوصول اليها من خالل",
            a:"متصفح الويب"
        },
        {
            q:"برامج تستخدم بغرض الحصول علي معلومات شخصية مثل أسماء  المستخدمين",
            a:"البرامج التجسسية"
        },
        {
            q:"صفحات الويب ال يمكن للزائرين معالجة محتواها",
            a:"صفحات ويب  ثابتة"
        },
        {
            q:" HTML",
            a:"اللغة األساسية في بناء و تصميم صفحات الويب"
        },
        {
            q:"لغة HTML قادرة",
            a:"علي تدوين المحتويات و تنسيق النصوص و كتابة الفقرات و تنقلنا الي صفحات اخري"
        },
        {
            q:"تحتوي لغة HTML علي",
            a:"اوسام و جذر و رموز"
        },
        {
            q:"تبدء صفحة ال HTML",
            a:"<َhtml>"
        },
        {
            q:"تنتهي صفحة ال HTML",
            a:"<َhtml/>"
        },
        {
            q:"من الرموز المحجوزة في ال HTML",
            a:"< ,>,&"
        },
        {
            q:" في هيئة الحلقة",
            a:"يتم تدفق البيانات خاللها في اتجاه واحد"
        },
        {
            q:"تحتوي لغة html على",
            a:"الرموز و الجذور و tags"
        },
        {
            q:"اللغات المستخدمة في اضافة اللمسات الجمالية لصفحات الويب",
            a:"CSS"
        },
        {
            q:"شبكة منتشرة بشكل كبير في مجال الشركات و المؤسسات يفيد  استخدام هذا النوع من الشبكات في مشاركة الملفات و المجلدات التي نريد  للعاملين الحصول عليه",
            a:"شبكه الانترانت"
        },
        {
            q:"تضغط البيانات",
            a:"لتصغير حجمها وسرعة ارسالها"
        },
        {
            q:" يمكن ان يطلق على السيرفر اسم اذا خصص لاداء مهمه معينه ",
            a:"dedicated server"
        },
        {
            q:"Server",
            a:"هو حاسب آلي قوي يمكنه اجراء عمليات معقدة  "
        },
        {
            q:"تعتبر بروتوكولات IP/TCP  بروتوكولات محوريه في باقة بروتوكولات",
            a:"IP/TCP"
        },
],
}
let counter = 0;
document.getElementById("quizAns").innerHTML="";
quiz.data.forEach(element => {
    document.getElementById("quizAns").innerHTML+=`
    <label style="background-color:#1D77C3" id="q-${counter}" for="quizo0">السؤال<br> ${element.q}</label>
    <label style="background-color:#268BED" id="a-${counter}" for="quizo0">الاجابة<br> ${element.a}</label>
    `;
});
let search = document.getElementById("search");
search.addEventListener("keyup",function(){
    if(search.value.length > 1){
        document.getElementById("quizAns").innerHTML="";
        quiz.data.forEach(element => {
            if (element.q.search(search.value) >= 0|| element.a.search(search.value) >= 0) {   
                document.getElementById("quizAns").innerHTML+=`
                <label style="background-color:#1D77C3" for="quizo0">السؤال<br> ${element.q}</label>
                <label style="background-color:#268BED" for="quizo0">الاجابة<br> ${element.a}</label>
                `;
            }
        });
    }else{
        document.getElementById("quizAns").innerHTML="";
    }
})