const quiz ={
    data:[{
        q:`الشبكة هي مجموعة من أجهزة الحاسب المتصلة ببعضها البعض بواسطة 
        نظم ادارة شبكات و بروتوكوالت و مكونات مادية لكن هذه المجموعة ال 
        تتشارك في الموارد و المعلومات وال تحقق الاتصالات
        `,
        o: ["صح","خطأ"],
        a:1
    },
    {
        q:`مجموعات العمل: مجموعة من الحاسبات الطرفية التي ال تصلح لتكوين 
        شبكة`,
        o: ["صح","خطأ"],
        a:1
    },
    {
        q:`تنتمي شبكة االنترنت الي الشبكات المحلية `,
        o: ["صح","خطأ"],
        a:1
    },
    // {
    //     q:`ما هي الفوائد التي تعود علينا من إقامة / بناء الشبكات`,
    //     a:"مشاركة الموارد,الامان,التنظيم و المركزية,سهولة االتصاالت"
    // },
    // {
    //     q:`ما هي األمور التي يجب ان تأخذها في االعتبار قبل اختيار الشبكة`,
    //     a:"حجم المؤسسة و عدد المستخدمين,مستوي األمان,طبيعة عمل المؤسسة,مستوي الدعم اإلداري,االحتياجات,الميزانية"
    // },
    {
        q:` تنقسم الشبكات بحسب التقسيم الجغرافي الي شبكة نظير لنظير  شبكة 
        خادم / عميل`,
        o: ["صح","خطأ"],
        a:1
    },
    {
        q:` تنقسم الشبكات بحسب وظيفة توفير الخدمات و اتاحة الموارد الي LAN
        WAN`,
        o: ["صح","خطأ"],
        a:1
    },
    {
        q:`الهيئة المادية للشبكات توضح كيفية سير البيانات و المعلومات داخل 
        الشبكة`,
        o: ["صح","خطأ"],
        a:1
    },
    {
        q:"من مميزات هيئة الشبكة وجود نهايات طرفية",
        o: ["صح","خطأ"],
        a:1
    },
    {
        q:"تطبيق تقنية التوكن علي هيئة الناقل",
        o: ["صح","خطأ"],
        a:1
    },
    {
        q:"تندفع إشارة التوكن في العديد من االتجاهات و نادرا ما تمنع التصادمات",
        o: ["صح","خطأ"],
        a:1
    },
    {
        q:"تتلخص طريقة الوصول CA/CSMA في ارسال رسالة طويلة جدا  علي الشبكة فاذا استقبلت بدون تصادم او مشاكل يتم ارسال الرسالة االصلية",
        o: ["صح","خطأ"],
        a:1
    },
    {
        q:"في كابل الشبكة ال TP عدد ازواج االسالك المجدولة 10 ازواج",
        o: ["صح","خطأ"],
        a:1
    },
    {
        q:"5RJ يستخدم في توصيل الكبل المحوري بكارت الشبكة",
        o: ["صح","خطأ"],
        a:1
    },
    {
        q:"من الكابالت المستخدمة في الشبكات : الكابالت المحورية  االلياف البالستيكية – S",
        o: ["صح","خطأ"],
        a:1
    },
    {
        q:"تشبه أجهزة ال repeater أجهزة ال Hub الخاملة",
        o: ["صح","خطأ"],
        a:1
    },
    {
        q:"يقوم ال switch بارسال البيانات المراد ارسالها من جهاز الي اخر  باستخدام address I",
        o: ["صح","خطأ"],
        a:1
    },
    {
        q:"يستخدم الروتر كجهاز مركزي في الشبكة المحلية االسلكية",
        o: ["صح","خطأ"],
        a:1
    },
    {
        q:"يقوم ال switch بتقسيم الشبكة الواحدة الي شبكات فرعية و ذلك  يقلل من حدوث التصادمات",
        o: ["صح","خطأ"],
        a:1
    },
    // {
    //     q:"اذكر اهم مكونات و عناصر الشبكات ",
    //     a:"أجهزة الحاسب, طابعات , كابلات , وصلات , أجهزة مركزية , الروتر , أجهزة المودم"
    // },
    // {
    //     q:"اذكر أسماء األجهزة المركزية في هيئة النجمة ",
    //     a:"Hub,Repeater,Switch,Server,Access Point"
    // },
    // {
    //     q:"عرف الطبقات (Layers)",
    //     a:"تنقسم المشروع بناءا علي اقسامه و مكوناته المنطقيه ذات العلاقه الوظيفيه"
    // },
    // {
    //     q:"عرف الشرفات ) Tiers)",
    //     a:"لها علاقه بالوجود الفيزيائي سواء وجدت علي حساب او خوادم"
    // },
    {
        q:"السيرفر او الخادم: عبارة عن حاسب الي يقوم باستخدام موارد  الشبكة",
        o: ["صح","خطأ"],
        a:1
    },
    {
        q:"العميل: هو حاسب الي قوي يقوم بتقديم الخدمات و الموارد للعمالءالمتصلين بالشبكة و يقوم بتشغيل برمجيات تعمل علي التحكم في الشبكة",
        o: ["صح","خطأ"],
        a:1
    },
    // {
    //     q:"ال http هو",
    //     a:"بروتوكول نقل نص التشعيبي "
    // },
    // {
    //     q:"محركات البحث هي",
    //     a:"مواقع خدمية الغرض الرئيسي منها هو البحث عن المعلومات او الملفات المطلوبة "
    // },
    // {
    //     q:"ملفات تعريف االرتباط ال Cookies هي",
    //     a:"ملفات يقوم الموقع الالكتروني باستحداثها عند دخولك علي موقع ما"
    // },
    // {
    //     q:"من البرامج الخبيثة",
    //     a:"الدودة ,البرامج التجسسية,احصنة طروادة"
    // },
    // {
    //     q:"الفيروسات",
    //     a:"برنامج من صنع االنسان تستخدم بغرض تدمير البيانات الموجودة علي الجهاز او الحاق الضرر به"
    // },
    // {
    //     q:"احصنة طروادة",
    //     a:"تبدوا كما لو كانت برامج مفيدة لكن في الحقيقة هي  برامج تحتوي علي الفيروسات"
    // },
    // {
    //     q:"تعٌرف الشبكات",
    //     a:" هي مجموعة من أجهزة الحاسب المتصلة ببعضها  البعض بواسطة نظم ادارة شبكات و بروتوكوالت و مكونات مادية و  تتشارك الموارد و تحقق االتصاالت"
    // },
    // {
    //     q:"فوائد الشبكات",
    //     a:"مشاركة الموارد,الامان,التنظيم و المركزيه,سهوله الاتصالات "
    // },
    // {
    //     q:"أنواع شبكات الحاسب",
    //     a:"النطاق الشخصي ) PAN),الشبكة المحلية ) LAN), الشبكة الداخلية المحدودة ) CAN(,الشبكة المدنية ) MAN),الشبكة الممتدة ) WAN),شبكة التخزين ) SAN),شبكة المؤسسات الخيرية ) EPN)"
    // },
    // {
    //     q:"أنواع الشبكات من حيث أسلوب التوصيل",
    //     a:"شبكة نظير لنظير,شبكة خادم "
    // },
    // {
    //     q:" الهيئة المادية للشبكة",
    //     a:"هيئة نقطة لنقطة,هيئة الناقل, هيئة الحلقة,هيئة النجمة,هيئة الشجرة,هيئة التشبيك,هيئة الهجين"
    // },
    // {
    //     q:"الهيئة المنطقية للشبكة",
    //     a:"تقنية الايثرنت,تقنية إشارة توكن,تقنية ال FDDI,Wireless تقنيه"
    // },
    {
        q:"تقوم تقنية ال CA/CSMA بارسال رسالة قصيرة علي الشبكة اذا  استقبلتها بدون تصادم يتم ارسال الرسالة االصلية",
        o: ["صح","خطأ"],
        a:0
    },
    {
        q:"لالحاق جهاز جديد بهيئه bus topology  يتم اضافه T connector",
        o: ["صح","خطأ"],
        a:0
    },
    {
        q:"تكون سرعة تقنية ال FDDI من 100 الي 620 في حالة الكابالت  النحاسية",
        o: ["صح","خطأ"],
        a:1
    },
],
hWrap: null, // HTML quiz container
    hQn: null, // HTML question wrapper
    hAns: null, // HTML answers wrapper
    
    now: 0, // current question
    score: 0, // current score
    
    init: () => {
    quiz.hWrap = document.getElementById("quizWrap");
    
    quiz.hQn = document.createElement("div");
    quiz.hQn.id = "quizQn";
    quiz.hWrap.appendChild(quiz.hQn);
    
    quiz.hAns = document.createElement("div");
    quiz.hAns.id = "quizAns";
    quiz.hWrap.appendChild(quiz.hAns);
    
    quiz.draw();
    },
    
    draw: () => {
    quiz.hQn.innerHTML = quiz.data[quiz.now].q;
    
    quiz.hAns.innerHTML = "";
    for (let i in quiz.data[quiz.now].o) {
    let radio = document.createElement("input");
    radio.type = "radio";
    radio.name = "quiz";
    radio.id = "quizo" + i;
    quiz.hAns.appendChild(radio);
    let label = document.createElement("label");
    label.innerHTML = quiz.data[quiz.now].o[i];
    label.setAttribute("for", "quizo" + i);
    label.dataset.idx = i;
    label.addEventListener("click", () => {quiz.select(label);});
    quiz.hAns.appendChild(label);
    }
    },
    
    select: option => {
    let all = quiz.hAns.getElementsByTagName("label");
    for (let label of all) {
    label.removeEventListener("click", quiz.select);
    }
    
    let correct = option.dataset.idx == quiz.data[quiz.now].a;
    if (correct) {
    quiz.score++;
    option.classList.add("correct");
    } else {
    option.classList.add("wrong");
    }
    
    quiz.now++;
    setTimeout(() => {
    if (quiz.now < quiz.data.length) {quiz.draw();} else { quiz.hQn.innerHTML=`لقد حصلت علي ${quiz.score} من ${quiz.data.length} :).`; quiz.hAns.innerHTML="" ; } }, 1000); }, reset: ()=> {
        quiz.now = 0;
        quiz.score = 0;
        quiz.draw();
        } 
}
        window.addEventListener("load", quiz.init);