{
   "data":
    [
        {
           "q":"هي مجموعه من الافراد والبيانات والاجراءات المرتبطة مع بعضها البعض لتقديم معلومات مفيده",
           "o":[""],
           "a":"نظم المعلومات"
        },
        {
           "q":"هي نوع من انواع انظمة المعلومات المصممة لتزويد ادارة المنظمة بالمعلومات",
           "o":[""],
           "a":"نظم المعلومات الإدارية"
        },
        {
           "q":"يتكون نظام المعلومات من",
           "o":[""],
           "a":"حاسب آلي & أفراد & برمجيات"
        },
        {
           "q":"هي مرحلة الخمسينات وجزء من الستينات",
           "o":[""],
           "a":"مرحلة التركيز علي البيانات"
        },
        {
           "q":"هي المرحله التي تركز علي ان الحاسب قادر علي أشياء أكثر بكثير من تشغيل البيانات",
           "o":[""],
           "a":"التركيز علي المعلومات"
        },
        {
           "q":"ذادت أهمية نظم المعلومات الإدارية للعديد من الأسباب منها",
           "o":[""],
           "a":"نظم المعلومات وحجمها & وزيادة درجة التخصص ف العمل بالمنظمات"
        },
        {
           "q":"تساعد نظم المعلومات الادارية المنظمات في",
           "o":[""],
           "a":"تخفيض التكفة وفتح اسواق جديدة وخلق المنتجات"
        },
        {
           "q":"يمكن تحديد دور المنظمات من خلال وجهتين نظر مختلفتين حيث تركز وجهة النظر الاولي علي",
           "o":[""],
           "a":"دور تقنية معلومات الحاسبت"
        },
        {
           "q":"هي الشكل الظاهري لمجموعة حقائق غير منظمة",
           "o":[""],
           "a":"البيانات"
        },
        {
           "q":"لا تعطي معني وهي منفردة",
           "o":[""],
           "a":"البيانات"
        },
        {
           "q":"هي الشئ الذي يغير الحالة المعرفية للشخص في موضوع أو مجال",
           "o":[""],
           "a":"المعلومات"
        },
        {
           "q":"هي الفهم المكتسب من خلال الخبرات والدراسة وقد تكون حقائق تراكمية أو قواعد إجرائية أو توجيهات",
           "o":[""],
           "a":"المعرفة"
        },
        {
           "q":"هي مزيج من المفاهيم والأفكار والقواعد والإجراءات اتي تهدي الأفعال والقرارات",
           "o":[""],
           "a":"المعرفة"
        },
        {
           "q":"تعني ....... إحتواء المعلومات المتوفرة للحقائق الأساسيةالتي يحتاجها المدير لإتخاذ القرارات",
           "o":[""],
           "a":"الشمول"
        },
        {
           "q":"هي تلك المعلومات التي توافق أو تطابق إحتياجات المدير متخذ القرار",
           "o":[""],
           "a":"الملائمة"
        },
        {
           "q":"هي مجموعة ذات طابع إنتظامي لمكونات مستقلة مترابطة ومتكاملة ولكنها تعتمد علي بعضها البعض من أجل تحقيق الأهداف المشتركة",
           "o":[""],
           "a":"النظم"
        },
        {
           "q":"تمثل .......... المواد الللازمة للنظام ليتمكن من القيام بالأنشطة المختلفة لتحقيق الأهداف",
           "o":[""],
           "a":"المدخلات"
        },
        {
           "q":"مجموعة متكاملة من البرمجيات والحزم الجاهزه والنماذج وأدوات المعالجة تتفاعل مع البيانات والمعلومات لتقديم الحلول المقترحة",
           "o":[""],
           "a":"نظم دعم القرار"
        },
        {
           "q":"تهئ ............... للمدير أساليب التحليل",
           "o":[""],
           "a":"نظم دعم القرار"
        },
        {
           "q":"يمكن تحدد أهداف يجب أن يحققها نظام دعم القرارت في",
           "o":[""],
           "a":"مساعدة المدراء لحل المشكلات شبه المهيكله & دعم القرارات بدل من تغييرها & وتحسين فاعلية إتخاذ القرارات وليس لحفظها فقط"
        },
        
        {
           "q":"يتضمن ....... جمع وتحليل البيانات المترابطة بالمشكلات المحددة",
           "o":[""],
           "a":"التصميم"
        },
        {
           "q":"يتضمن ........ تقييم البدائل وتقييم المخرجات",
           "o":[""],
           "a":"التصميم"
        },
        {
           "q":"هو ذلك الفرع من علوم الحاسوب الذي يمكن بواسطته خلق وتصميم برامج الحاسب الآلي",
           "o":[""],
           "a":"الذكاء الأصطناعي"
        },{
           "q":"هو جزء من علم الحاسبات الذي يهتم بأنظمة الحاسوب الذكية",
           "o":[""],
           "a":"الذكاء الإنساني"
        },
        {
           "q":"الذكاء الأصطناعي نوعين من الوظائف يتضمن النوع الأول",
           "o":[""],
           "a":"لغة الطبيعة & التخطيط & الحركة"
        },
        {
           "q":"هي أصغر وحدة للحاسب",
           "o":[""],
           "a":"البت"
        },
        {
           "q":"تطبق ...... في مجال محدد مثل التعرف علي الأشكال",
           "o":[""],
           "a":"الشبكات العصبونية"
        },
        {
           "q":"تعتمد ...... علي قاعدة معرفة تمثل خبرة الإنسان في مجال محدد",
           "o":[""],
           "a":"النظم الخبيرة"
        },
        {
           "q":"معظم نظم دعم القرار المستخدمة حاليا قد صممت بالأصل لدعم القرار",
           "o":[""],
           "a":"الفردية"
        },
        {
           "q":"تستخدم نظم دعم القرار الجماعي لحل المشاكل",
           "o":[""],
           "a":"غير المهيكلة"
        },
        {
           "q":"و.......... نظام تفاعلي مبني علي الحاسب يدعم مجموعة من الناس يتشاركون في مهمة واحدة",
           "o":[""],
           "a":"نظم دعم القرار الجماعي"
        },
        {
           "q":"ما يميز نظم دعم القرار الجماعي هو المشاركة في",
           "o":[""],
           "a":"قاعدة البيانات"
        },
        {
           "q":"تحتوي نظم دعم إإتخاذ القرار الجماعي علي",
           "o":[""],
           "a":"أجهزة & برمجيات & أفراد"
        },
        {
           "q":"تعني ....... أن تكون المعلومات بالصورة الصحيحة خالية من أي أخطاء",
           "o":[""],
           "a":"الدقة"
        },
        {
           "q":"أن تكون المعلومات مستقلة فيما بينها دون تعارض أو تناقض",
           "o":[""],
           "a":"الوضوح"
        },
        {
           "q":"تعني أن تكون المعلومات مناسبة ويمكن إستخدامها في تلبية رغبات أكثر من مستفيد",
           "o":[""],
           "a":"المرونة"
        },
        {
           "q":"يمكن النظر لمفهوم الأمن والمعلومات من زوايا ......... علي أنه الوسائل والأدوات والإجرائات اللازم توافرها لضمان حماية المعلومات من الأخطاء الداخلية والخارجية",
           "o":[""],
           "a":"تقنية"
        },
        {
           "q":"عرفت ............... علي أنها عدم السماح بلأشخاص غير المسرح لهم بالإطلاع علي ملومة معينة والوصول إل تلك المععلومات",
           "o":[""],
           "a":"سرية الملومات *"
        },
        {
           "q":"هي مجموعة من الحقول المترابطة (الإسم,السن,الرقم)",
           "o":[""],
           "a":"السجل"
        },
        {
           "q":"الصفات أو المعلومات الأساسية التي تكون هامةجدا للكيان",
           "o":[""],
           "a":"الخاصية"
        },
        {
           "q":"يشير إلي القيمة المتلقة بالخاصية",
           "o":[""],
           "a":"عنصر البيانات"
        },
        {
           "q":"يمثل ....... مجموعة من الحروف المترابطة قد تكون إسم طالب",
           "o":[""],
           "a":"الحقل"
        },
        {
           "q":"أصغر عنصر منطقي يتكون من حرف أو رمز أأو رقم",
           "o":[""],
           "a":"البايت"
        },
        {
           "q":"تعني أن تكون المعلومات مناسبة لطلب المستفيد",
           "o":[""],
           "a":"الدقة"
        },
        {
           "q":"الذكاءالأصطناعي نوعين من الوظائف التي منها",
           "o":[""],
           "a":"وظائف & حياتية & ذكية"
        },
        {
           "q":"هي نظام حاسوبي متفاعل لتسهيل حل المشاكل بواسطة مجموعه من صانعي القرار",
           "o":[""],
           "a":"نظم دعم القرار الجماعي"
        },
        {
           "q":"يبني ............ بناء علي حاجة المستفيدين الفعلية مع ملاحظة التغيرات البيئية التي يتعامل معها",
           "o":[""],
           "a":"دعم القرار"
        },

        {
           "q":"يعرف النظام بأنه مجموعة من الأفراد والبيانات والإجراءات المرتبطة مع بعضها البعض لتقديم معلومات مفيدة",
           "o":["خطأ","صح"],
           "a": 0
        },
        {
           "q":"لا يمكن أن تحوز المؤسسة علي نظام للمعلومات بشكل غير رسمي",
           "o":["خطأ","صح"],
           "a": 0
        },
        {
           "q":"يتكون نظام المعلومات أساسا من الوسائل التكنلوجيا فقط",
           "o":["خطأ","صح"],
           "a": 0
        },
        {
           "q":"لا ترتبط نظم المعلومات الإدارية الحديثة أرتباطا وثيقا بأنتشار إستخدام الحاسوب",
           "o":["خطأ","صح"],
           "a": 0
        },
        {
           "q":"تؤدي نظم المعلومات الإدارية إلي جمع بيانات عن العمليات بطريقة تمكن من مقابلة الإحتياجات الرئيسية للتنظيم",
           "o":["خطأ","صح"],
           "a": 1
        },
        {
           "q":"تهدف نظم المعلومات الإدارية إلي تدعيم ومساندة الوظائف الإدارية وإتخاذ القرارت",
           "o":["خطأ","صح"],
           "a": 1
        },
        {
           "q":"أقتصرت مرحلة التركيز علي المعلومات علي إنتاج البيانات",
           "o":["خطأ","صح"],
           "a": 0
        },
        {
           "q":"بعد إزدياد درجة التعقد التكنولوجي في المجتمع بصفة عامة أحد أهم إنشاء نظم المعلومات الإدارية",
           "o":["خطأ","صح"],
           "a": 1
        },
        {
           "q":"من الأمثلة علي مساندة الأنشطة الأساسية إدارة الموارد البشرية",
           "o":["خطأ","صح"],
           "a": 0
        },
        {
           "q":"تكمن أهمية نظم المعلومات الإدارية في مساندة عمليات المنظمة الداعمة والأساسية",
           "o":["خطأ","صح"],
           "a": 1
        },
        {
           "q":"من الأمثلة علي مساندة الأنشطة الأساسية ,التسويق والمبيعات , وخدمة العملاء",
           "o":["خطأ","صح"],
           "a": 1
        },
        {
           "q":"يمكن تحديد دور نظام المعلومات في المنظمة من خلال ثلاث وجهات نظر مختلفة",
           "o":["خطأ","صح"],
           "a": 0
        },
        {
           "q":"تركز وجهة النظر الأولي لتحديد دور نظام المعلومات علي نقاط القوة الإمكانيات الموجودة في المنظمة وعلي الفرص التي يمكن الإستفادة منها",
           "o":["خطأ","صح"],
           "a": 0
        },
        {
           "q":"تركز وجهة النظر الثانية لتحديد دور نظام المعلومات علي دور تقنية المعلومات للحا",
           "o":["خطأ","صح"],
           "a": 0
        },
        {
           "q":"يقيم نظام المعلومات المعلومات إلي المستويات B134+ الإدارية العلية فقط",
           "o":["خطأ","صح"],
           "a": 0
        },
        {
           "q":"تساعد نظم المعلومات الإدارية المنظمة في تقدم للإدارة تمثيلا لسلسة من الطرق البديلة , لإنجاز العمل بشكل يبين تأثيرات ونتائج القرارات المختلفة قبل أن تطبق عمليا",
           "o":["خطأ","صح"],
           "a": 0
        },
        {
           "q":"تساعد نظم المعلومات الإدارية في تكامل التنظيم وتوازنة حيث تنتج له قنوات جيدة الإتصال",
           "o":["خطأ","صح"],
           "a": 0
        },
        {
           "q":"تسهيل نظم المعلومات الإدارية عمليات إتخاذ القرارات علي كافة نوعياتها ومستوياتها",
           "o":["خطأ","صح"],
           "a": 1
        },
        {
           "q":"لا تفيد المعلومات التي تقدمها نظم المعلومات الإدارية لأغراض المتابعة والرقابة وقياس الأداء",
           "o":["خطأ","صح"],
           "a": 0
        },
        {
           "q":"لا تتطلب البيانات التي تحتاجها نظم المعلومات الإدارية الشمول حيث أنها في مرحلة الإعداد",
           "o":["خطأ","صح"],
           "a": 0
        },





        {
           "q":"عمليات تخزين المعلومات هي تحويلها من هيئتها الأولية إلي معلومات ذات معني وقيمة",
           "o":["خطأ","صح"],
           "a": 0
        },
        {
           "q":"يهدف النظام إلي المساعدة في صنع القرارات التي يمكن برمجتها فقط",
           "o":["خطأ","صح"],
           "a": 0
        },
        {
           "q":"يهدف نظام المعلومات الإدارية إلي مساندة ودعم العمليات الخاصة بالمنظمة في مجالاتها الوظيفية المختلفة",
           "o":["خطأ","صح"],
           "a": 1
        },
        {
           "q":"يعمل النظام علي تدعيم ومساعدة الوظائف الإدارية من تسويق , إنتاج , تمويل وغيرها",
           "o":["خطأ","صح"],
           "a": 0
        },
        {
           "q":"يتميز نظام المعلومات الإدارية بشكله الحديث هو إعتماده علي الحاسب الآلي في شكل متكامل بين الإنسان الآلة",
           "o":["خطأ","صح"],
           "a": 1
        },
        {
           "q":"يعمل النظام علي تدعيم ومساعدة الوظائف الإدارية من تخطيط بمقارنة الأداء الفعلي للمنظمة المطلوب",
           "o":["خطأ","صح"],
           "a": 0
        },
        {
           "q":"يمكن القول بأن نظم المعلومات الإدارية تخدم كافة المجالات الوظيفية للمنظمة وكذا جميع الأنشطة الإدارية في جميع المستويات التنظيمية",
           "o":["خطأ","صح"],
           "a": 1
        },
        {
           "q":"تعد الرقابة علي عميلة تداول البيانات والمعلومات وحفظها من بين المهام التي تبرز فيها أهمية نظم امعلومات الإدارية علي مستوي الأداء الداخلي للمنظمة",
           "o":["خطأ","صح"],
           "a": 0
        },
        {
           "q":"تعد نظم المعلومات الإدارية نظم مغلقه تؤثر وتتأثر بالبيئة الخارجية",
           "o":["خطأ","صح"],
           "a": 0
        },
        {
           "q":"إن هدف نظم المعلومات الإدارية هو تحقيق الكفاءة بتوفير المعلومات الصحيحة واللازمة لإتخاذ القرارات",
           "o":["خطأ","صح"],
           "a": 0
        },
        {
           "q":"إن هدف نظم المعلومات الإدارية هو تحقيق الفاعلية بتوفير المعلومات بأقل كلفة ممكنة",
           "o":["خطأ","صح"],
           "a": 0
        },
        {
           "q":"هناك بعض المعلومات لا يمكن إدخالها ف النظام",
           "o":["خطأ","صح"],
           "a": 1
        },
        {
           "q":"البيانات الكمية  يمكن فهمها إلا إذا تم ربطها ببيانات أخري مثل حجم الطلب المتوقع",
           "o":["خطأ","صح"],
           "a": 1
        },
        {
           "q":"قيمة المعلومات تتناقص بمرور الزمن",
           "o":["خطأ","صح"],
           "a": 1
        },
        {
           "q":"إن إحتمالات الوقوع في الخطأ أكبر بكثير في النظم المحوسبة من النظم التقليدية اليدوية",
           "o":["خطأ","صح"],
           "a": 0
        },
        {
           "q":"إن خيارات إسترجاع المعلومات أوسع وأفضل في النظم التقليدية منها المحوسبة",
           "o":["خطأ","صح"],
           "a": 0
        },
        {
           "q":"تدعم نظم المعلومات التسويقية علي المستوي المعرفي تدعم تحليل محطات العمل",
           "o":["خطأ","صح"],
           "a": 1
        },
        {
           "q":"تدعم نظم المعلومات التسويقية علي المستوي الإستراتيجي تحل أداء المبيعات وفريق المبيعات",
           "o":["خطأ","صح"],
           "a": 0
        },
        {
           "q":"تهتم نظم التصنيع والإنتاج علي المستوي الإستراتيجي بدعم النشاطات التي تهتم بالتخطيط والمراقبة لعملية إنتاج السلع والخدمات",
           "o":["خطأ","صح"],
           "a": 1
        },
        {
           "q":"تعمل نظم المعلومات المالية والمحاسبية علي المستوي التشغيلي علي الإشراف علي التدفق النقدي في الشركة من خلال التبادلات المختلفة من مدفوعات ومقبوضات",
           "o":["خطأ","صح"],
           "a": 1
        },




        {
           "q":"تساعد نظم معلومات الموارد البشرية علي المستوي الإداري علي تأمين ونشر المعرفة والخبرة قيادة العملية الإنتاجية",
           "o":["خطأ","صح"],
           "a": 0
        },
        {
           "q":"الأجهزة والشبكات هي الأنظمة التي تشغل البيانات والمعلومات والمعارف وتحدد العمليات التي ستؤديها الأجهزة",
           "o":["خطأ","صح"],
           "a": 0
        },
        {
           "q":"تسمي الإجراءات أحيانا خريطة مسار النظام",
           "o":["خطأ","صح"],
           "a": 1
        },
        {
           "q":"تعد الإجراءات أدلة عمل تشرح ما الذي يجب عمله ومن الذي سيعمله ومتي سيتم عمله",
           "o":["خطأ","صح"],
           "a": 1
        },
        {
           "q":"تساند نظم دعم القرارات كافة فئات متخذي القرارات",
           "o":["خطأ","صح"],
           "a": 1
        },
        {
           "q":"جوهر نظم دعم إتخاذ القرارات هو التنبؤ والإنذار المبكر وصياغة السيناريوهات المبنية علي نماذج معينة",
           "o":["خطأ","صح"],
           "a": 0
        },
        {
           "q":"تقوم نظم دعم القرار بعمل المزج بين البيانات المتاحة مع الرؤي الشخصية لمتخذ القرار",
           "o":["خطأ","صح"],
           "a": 0
        },
        {
           "q":"تعتبر البيانات الحاضنة الأساسية لمعطيات أرقي تنبثق عنها نتيجة المعالجة",
           "o":["خطأ","صح"],
           "a": 1
        },
        {
           "q":"المعلومات هي الشكل الظاهري لمجموعة حقائق غير منظمة قد تكون علي شكل أرقام أو كلمات أو صور لا علاقة بينها",
           "o":["خطأ","صح"],
           "a": 0
        },
        {
           "q":"لا تعطي البيانات معني وي منفردة",
           "o":["خطأ","صح"],
           "a": 1
        },
        {
           "q":"البيانات ليست ذات قيمة بشكلها الأولي",
           "o":["خطأ","صح"],
           "a": 1
        },
        {
           "q":"البيانات هي المعلومات التي تمت معالجتها وتحويلها إلي شكل له معني",
           "o":["خطأ","صح"],
           "a": 0
        },
        {
           "q":"البيانات هي تركيبة متجانسة من الأفكار والمفاهيم تمكن الإنسان من الإستفادة منها في الوصول لي المعرفة وإكتشاف",
           "o":["خطأ","صح"],
           "a": 0
        },
        {
           "q":"البيانات هي الشئ الذي يغير الحالة المعرفية للشخص في موضوع ما أو مجال ما",
           "o":["خطأ","صح"],
           "a": 0
        },
        {
           "q":"البيانات هي نوع من المعرفة الناتجة من عمليات تشغيلية لخدمة أغراض بعينه",
           "o":["خطأ","صح"],
           "a": 0
        },
        {
           "q":"المعلومات هي الفهم المكتسب من خلال الخبرات والدراسة وقد تكون حقائق تراكمية ظاو قواعد إجرائية أو توجيهات",
           "o":["خطأ","صح"],
           "a": 0
        },
        {
           "q":"المعرفة هي حصيلة الإمتزاج الخفي بين المعلومات والخبرة والمدركات الحسية والقدرة علي الحكم",
           "o":["خطأ","صح"],
           "a": 1
        },
        {
           "q":"المعرفة هي مزيج من المفاهيم والأفكار والقواعد والإجراءات التي تهدي الأفعال والقرارات",
           "o":["خطأ","صح"],
           "a": 1
        },
        {
           "q":"تعرف المعلومات بأنها معرفة تمت معالجتها وتنظيمها لإكتساب مستخدميها الخبرة والقدرة علي إتخاذ القرارات وحل المشاكل",
           "o":["خطأ","صح"],
           "a": 0
        },
        {
           "q":"تعطي المصادر الداخلية تعطي البيانات علي شكل رسمي وغير رسمي من داخل المنظمة",
           "o":["خطأ","صح"],
           "a": 1
        },




        
        {
           "q":"يعني الشمول إحتواء المعلومات المتوفرة للحقائق الأساسية التي يحتاجها المدير لإتخاذ القرارات",
           "o":["خطأ","صح"],
           "a": 1
        },
        {
           "q":"الملائمة هي مطابقة إحتياجات المدير متخذ القرارات",
           "o":["خطأ","صح"],
           "a": 1
        },
        {
           "q":"يعد من أهم خصائص المعلومات قابليتها للقياس",
           "o":["خطأ","صح"],
           "a": 1
        },
        {
           "q":"بإعتبار المنظمة نظام مغلق يجب عليها معرفة ما يحيط بها كي تكون قادرة علي مواجهة كل التغيرات",
           "o":["خطأ","صح"],
           "a": 0
        },
        {
           "q":"عرفه الشمولية بأنه مجموعة من الأجزاء التي تتفاعل مع بعضها البعض ومع بينتها لتحقيق هدف أو أهداف معينة",
           "o":["خطأ","صح"],
           "a": 0
        },
        {
           "q":"عرف النظام علي أنه مجموعة ذات طابع إنتظامي لمكونات مستقلة مترابطة ومتكاملة",
           "o":["خطأ","صح"],
           "a": 1
        },
        {
           "q":"عرف النظام علي أنه مجموعة مترابطة ومتجانسة من الموارد والعناصر(الأفراد , التجهيزات , الآلات , الأموال , السجلات ... إلخ) الت تتفاعل مع بعضها البعض خارج إطار معين (حدود النظام)",
           "o":["خطأ","صح"],
           "a": 0
        },
        {
           "q":"تشمل المدخلات العديد من العناصر الغير متجانسة",
           "o":["خطأ","صح"],
           "a": 1
        },
        {
           "q":"تمثل العمليات الموارد اللازمة للنظام ليتمكن من القيام بلأنشطة المختلفة لتحقيق الأهداف",
           "o":["خطأ","صح"],
           "a": 0
        },
        {
           "q":"يقصد بالعمليات تحويل المدخلات إلي مخرجات",
           "o":["خطأ","صح"],
           "a": 1
        },
        {
           "q":"تعد المخرجات الأداة التي من خلالها يتم التحقيق من أداء النظام وقدرته علي تحقيق أهدافه",
           "o":["خطأ","صح"],
           "a": 1
        },
        {
           "q":"تعتبر المدخلات الأداة الصحيحة للمخرجات أي أداة لتحقيق الرقابة علي أداء النظام",
           "o":["خطأ","صح"],
           "a": 0
        },
        {
           "q":"تعمل المعلومات المرتدة التطويرية علي تغيير الأهداف",
           "o":["خطأ","صح"],
           "a": 1
        },
        {
           "q":"تمثل العلاقات الوسيلة التي من خلالها يتم ربط النظم الفرعية ببعضها البعض , وأيضا ربط النظام ببيئته",
           "o":["خطأ","صح"],
           "a": 1
        },
        {
           "q":"يقصد بالمعلومات المرتدة التطويرية إرجاع الأشياء إلي وضعها الصحيح",
           "o":["خطأ","صح"],
           "a": 0
        },
        {
           "q":"النظم المجردة فهي التي لا يمكن لمسها وإنما يمكن تصورها عقليا مثل نظام المعادت الجبرية",
           "o":["خطأ","صح"],
           "a": 1
        },
        {
           "q":"النظام المتغير فهو الذي يعمل وفق آلية معينة ثابته وبشكل مستمر ولا يمكن التنبؤ بسلوكه مستقب بشكل حتمي",
           "o":["خطأ","صح"],
           "a": 0
        },
        {
           "q":"تعني كلمة نظم دعم القرار البت النهائي النهائي والإدارة المحددة لصانع القرار بشأن ما يجب وما لا يجب فعله للوصول إلي الهدف",
           "o":["خطأ","صح"],
           "a": 1
        },
        {
           "q":"الوسيلة هي مسار يختاره المقرر بإعتباره أنسب وسيلة متاحه لإنجاز الهدف أوالأهداف التي يبتغيها لحل المشكلات التي تشغله",
           "o":["خطأ","صح"],
           "a": 0
        },
        {
           "q":"القرار هو عملية الإختيار بين مجموعة من البدائل لتحقيق هدف واحد أو عدة أهداف",
           "o":["خطأ","صح"],
           "a": 1
        },





        {
           "q":"لا يشترط عند إتخاذ القرار وجود بدائل",
           "o":["خطأ","صح"],
           "a": 0
        },
        {
           "q":"يعد تحدد الحول البديلة الخطوات الأولة في مرحلة صنع القرار",
           "o":["خطأ","صح"],
           "a": 0
        },
        {
           "q":"متخذ القرار هو الشخص الذي بيديه سلطة إتخاذ القرار رغم أنه لم يقم بصنعه",
           "o":["خطأ","صح"],
           "a": 1
        },
        {
           "q":"صانع اللقرار هو الشخص الذي بيديه سلطة إتخاذ القرار",
           "o":["خطأ","صح"],
           "a": 1
        },
        {
           "q":"لا تعتبر عملية إتخاذ القرارات عمية إجرائية لأن الإختيار هو أساس إتخاذ القرار",
           "o":["خطأ","صح"],
           "a": 0
        },
        {
           "q":"إن إيجاد مجموعة من البدائل يعد مهما في عملية إتخاذ القرارات",
           "o":["خطأ","صح"],
           "a": 0
        },
        {
           "q":"تتسم القرارات في الإدارة الوسطي بأنها غير مبرمجة",
           "o":["خطأ","صح"],
           "a": 1
        },
        {
           "q":"يتخذ المديرون في المستوي الإشرافي العديد من القرارات التي تكون غير مبرمجة",
           "o":["خطأ","صح"],
           "a": 1
        },
        {
           "q":"تتميز القرارات في مستوي الإدارة الوسطي بأنها إستراتيجية تتعلق بنشاط ومستقبل المنظمة",
           "o":["خطأ","صح"],
           "a": 0
        },
        {
           "q":"تعد الخبرة من الأساليب التقليدية في إتخاذ القرارات",
           "o":["خطأ","صح"],
           "a": 1
        },
        {
           "q":"يعتمد إسلوب إجراءات التجارب علي تحديد ومناقشة البدائل غيابيا في إجتماع أعضائه غير موجودين وجها لوجه",
           "o":["خطأ","صح"],
           "a": 0
        },
        {
           "q":"يستخدم أسلوب تحليل التعادل في ظل ظروف الخطر",
           "o":["خطأ","صح"],
           "a": 0
        },
        {
           "q":"يعتمد أسلوب ونموذج المراجعة بالقوائم نسبيا علي الكام الشخصي",
           "o":["خطأ","صح"],
           "a": 1
        },
        {
           "q":"البيئة الخارجية لا تؤثر علي نتائج القرار عند إتخاذ القرار في حاة التأكد",
           "o":["خطأ","صح"],
           "a": 1
        },
        {
           "q":"إتخاذ القرارات في حالة المخاطرة هي القرارات التي غالبا ما تقوم بها الإدارة العليا عندما ترسم أهداف المشروع العامة وسياساته",
           "o":["خطأ","صح"],
           "a": 0
        },
        {
           "q":"إتخاذ القرار في حالة عدم التأكد هي إذا قرارات تتخذ في ظل ظروف من الممكن حدوثها ولكن لا تعرف درجة إحتمال حدوثها",
           "o":["خطأ","صح"],
           "a": 0
        },
        {
           "q":"يلاحظ علي القرارات المبرمجة إن معايير الحكم فيها عادة ما تكون واضحة",
           "o":["خطأ","صح"],
           "a": 1
        },
        {
           "q":"تتصف القرارات الغير مبرمجة بأنها متكررة وغغير روتينية",
           "o":["خطأ","صح"],
           "a": 0
        },
        {
           "q":"تتعلق القرارات التشغيلية بالرقابة علي المخزون",
           "o":["خطأ","صح"],
           "a": 1
        },






        {
           "q":"تصنع القرارات الإدارية في المستويات الدنيا بالتنظيم",
           "o":["خطأ","صح"],
           "a": 0
        },
        {
           "q":"في حالة التأكد يتم إتخاذ القرار بالمفاضلة الفورية المباشرة",
           "o":["خطأ","صح"],
           "a": 1
        },
        {
           "q":"تتعلق القرارات التكتيكية بإجمالي أهداف وأغراض المؤسسة",
           "o":["خطأ","صح"],
           "a": 0
        },
        {
           "q":"تتميز القرارات العملياتيه بكثرة تفصيلاتها",
           "o":["خطأ","صح"],
           "a": 1
        },
        {
           "q":"نظم دعم القرار مصممة لدعم متخذي القرارات في بيئه مؤكدة وهيكلية",
           "o":["خطأ","صح"],
           "a": 0
        },
        {
           "q":"نظم دعم القرار هي إستخدام موارد الأفراد مع قدرات الحاسوب لتحسين جودة القرار",
           "o":["خطأ","صح"],
           "a": 1
        },
        {
           "q":"نظم دعم القرار هو مجموعة منتظمة من الأجزاء , أو النظم الفرعية المترابطة , والمتفاعلة فيما بينها",
           "o":["خطأ","صح"],
           "a": 0
        },
        {
           "q":"القرار هو البديل الأمثل الذي يمثل حل المشكلة موضع",
           "o":["خطأ","صح"],
           "a": 1
        },
        {
           "q":"يساعد نظم دعم القرار المستخدمين في المستويات الإدارية العليا فقط",
           "o":["خطأ","صح"],
           "a": 0
        },
        {
           "q":"تدعم نظم المعلومات الإدارية تقلل تكلفة إتخاذ القرارات",
           "o":["خطأ","صح"],
           "a": 0
        },
        {
           "q":"يعد من أهم أهداف نظم المعلومات الإدارية القدرة علي دعم حلول المشكلات المتعددة",
           "o":["خطأ","صح"],
           "a": 0
        },
        {
           "q":"تساعد نظم دعم القرار المدراء في إتخاذ قرارات لحل المشكلات شبه المهيكلة",
           "o":["خطأ","صح"],
           "a": 1
        },
        {
           "q":"المقصود من نظم دعم القرار هو الإستغناء عن المدير",
           "o":["خطأ","صح"],
           "a": 0
        },
        {
           "q":"تتضمن إستخبارات الأعمال جمع وتحليل البيانات المترابطة بالمشكلة المحددة",
           "o":["خطأ","صح"],
           "a": 1
        },
        {
           "q":"تتضمن مرحلة الإختيار إيجاد نماذج مناسبة لتنظيم النتائج",
           "o":["خطأ","صح"],
           "a": 0
        },
        {
           "q":"تتضمن مرحلة التصميم إدارة فريق إتخاذ القرار",
           "o":["خطأ","صح"],
           "a": 0
        },
        {
           "q":"تتضمن مرحلة التنفيذ إختيار البديل الأفضل",
           "o":["خطأ","صح"],
           "a": 0
        },
        {
           "q":"يتصف إستخدام نظم دعم القرار بأنه تفاعلي",
           "o":["خطأ","صح"],
           "a": 0
        },
        {
           "q":"تلعب نظم دعم القرار دورا واسعا في إتخاذ القرارات شبه الهيكلية",
           "o":["خطأ","صح"],
           "a": 1
        },
        {
           "q":"تتميز القرارات الإدارية بالثبات النسبي الطويل الأجل",
           "o":["خطأ","صح"],
           "a": 0
        },





        {
           "q":"تتصف القرارات الإدارة بدرجة عالية من المركزية في إتخاذها",
           "o":["خطأ","صح"],
           "a": 0
        },
        {
           "q":"تؤخذ القرارات الإستراتجية عند قمة الهيكل التنظيمي بواسطة الإدارة العليا",
           "o":["خطأ","صح"],
           "a": 1
        },
        {
           "q":"غالبا ما تهدف القرارات الإستراتيجية إلي تقرير الوسائل المناسبة لتحقيق الأهداف",
           "o":["خطأ","صح"],
           "a": 0
        },
        {
           "q":"تتخذ القرارات الإدارية بواسطة الإدارة الوسطي",
           "o":["خطأ","صح"],
           "a": 1
        },
        {
           "q":"تتعلق القرارات الإدارية بمشكلات العمل اليومي وتنفيذه",
           "o":["خطأ","صح"],
           "a": 0
        },
        {
           "q":"تعتبر القرارات الإستراتيجية من إختصاص الإدارة المباشرة أو التنفيذية",
           "o":["خطأ","صح"],
           "a": 0
        },
        {
           "q":"تتميز القرارات التشغيلية بأنها لا تحتاج إلي المزيد من الجهد , والبحث والإبداع من قبل متخذها",
           "o":["خطأ","صح"],
           "a": 1
        },
        {
           "q":"يتم إتخاذ القرارات الإدارية بطريقة فورية",
           "o":["خطأ","صح"],
           "a": 0
        },
        {
           "q":"تتعلق القرارات الإستراتيجية بأسلوب العمل الروتيني وتتكرر بإستمرار",
           "o":["خطأ","صح"],
           "a": 0
        },
        {
           "q":"القرارات المهيكلة هي القرارات المخططة سلفا",
           "o":["خطأ","صح"],
           "a": 1
        },
        {
           "q":"تتناول القرارات غير المهيكلة مشكلة متكررة أو روتينية",
           "o":["خطأ","صح"],
           "a": 0
        },
        {
           "q":"تحتاج القرارات المهيكلة إلي جهد وإبداع فكري",
           "o":["خطأ","صح"],
           "a": 0
        },
        {
           "q":"تقوم المستويات التنفيذية بإتخاذ القرارات غير المهيكلة",
           "o":["خطأ","صح"],
           "a": 1
        },
        {
           "q":"تعالج القرارات مهيكلة مشاكل جديدة",
           "o":["خطأ","صح"],
           "a": 0
        },
        {
           "q":"تتعامل القرارات الغير المهيكلة مع المواقف غير المحددة أو غير المألوفة",
           "o":["خطأ","صح"],
           "a": 1
        },
        {
           "q":"تتطلب القرارات غير المهيكلة جهدا فكريا ووقتا كافيا لجمع المعلومات",
           "o":["خطأ","صح"],
           "a": 0
        },
        {
           "q":"تتخذ القرارات غير المهيكلة في مستويات الإدارة العليا",
           "o":["خطأ","صح"],
           "a": 1
        },
        {
           "q":"في حالة التأكد البيئة الخارجية لا تؤثر علي نتائج القرار",
           "o":["خطأ","صح"],
           "a": 1
        },
        {
           "q":"يقصد بحالة عدم التأكد تلك الحالة التي يوجد فيا أكثر من بديل",
           "o":["خطأ","صح"],
           "a": 1
        },
        {
           "q":"يدعم نظام دعم القرارات القرارات شبه المهيكلة فقط",
           "o":["خطأ","صح"],
           "a": 0
        },





        {
           "q":"متخذ القرار في حالة التأكد يستطيع أن يحدد كل البدائل الممكنة لكن لا يعرف علي وجه اليقين نتيجة كل بديل",
           "o":["خطأ","صح"],
           "a": 0
        },
        {
           "q":"القرارات تحت ظروف المخاطرة هي القرارات التي تتخذ في ظروف وحالات محتملة الوقوع",
           "o":["خطأ","صح"],
           "a": 1
        },
        {
           "q":"قرارات في حالة عدم التأكد هي القرارات التي تتخذ عندما ترسم أهداف المؤسسة العامة وسياستها",
           "o":["خطأ","صح"],
           "a": 1
        },
        {
           "q":"يتميز نظام دعم القرار الموجه بموجب النماذج بأنه لا يمكن فصله عن أنظمة المعلومات في المنظمة",
           "o":["خطأ","صح"],
           "a": 0
        },
        {
           "q":"تعتبر نظام دعم الققرار الموجه بموجب النماذج برامج جاهزة يتم إستخدامهما لأغراض محددة",
           "o":["خطأ","صح"],
           "a": 1
        },
        {
           "q":"تتعامل نظم دعم القرار مع قاعدة بيانات تشغيلية",
           "o":["خطأ","صح"],
           "a": 1
        },
        {
           "q":"تتعامل نظم المعلومات الإدارية مع قاعدة بيانات تحليلية",
           "o":["خطأ","صح"],
           "a": 0
        },
        {
           "q":"تحتوي نظم دعم القرار علي إدارة للنماذج الكمية",
           "o":["خطأ","صح"],
           "a": 1
        },
        {
           "q":"تتعامل نظم دعم القرار مع المشكلات الهيكلة",
           "o":["خطأ","صح"],
           "a": 0
        },
        {
           "q":"الذكاء الأصناعي مشابهة لدرجة ما للسلوك البشري فيما يخص اللغات , التعلم , التفكير , وحل المشكلات",
           "o":["خطأ","صح"],
           "a": 1
        },
        {
           "q":"الوظائف الخبيرة تعني كل المهام التي يمكن أن نقوم بها بشكل دوري , لكي تتصرف وتتفاعل في العالم",
           "o":["خطأ","صح"],
           "a": 0
        },
        {
           "q":"تتضمن الوظائف الخبيرة الرؤية مع القدرة علي فهم ما نراه",
           "o":["خطأ","صح"],
           "a": 0
        },
        {
           "q":"من تطبيقات الذكاء الأصطناعي ذات أغراض عامة التشخيص الطبي",
           "o":["خطأ","صح"],
           "a": 0
        },
        {
           "q":"تطبق نظم الشبكات العصبونية في التعرف علي الأشكال",
           "o":["خطأ","صح"],
           "a": 1
        },
        {
           "q":"يتعلق مفهوم الشبكات العصبونية ببرمجة الحواسيب",
           "o":["خطأ","صح"],
           "a": 0
        },
        {
           "q":"يرتبط مفهوم الشبكات العصبونية بحقل التعرف علي الكلام",
           "o":["خطأ","صح"],
           "a": 0
        },
        {
           "q":"يعرف النظم الخبيرة بأنه طريقة محددة يمكن إتباعها بإستمرار لإنجاز عمل , أو أداء مهمة معينة",
           "o":["خطأ","صح"],
           "a": 1
        },
        {
           "q":"عرفة النظم بأنها المعرفة الواسعة المحددة لمهمة أو عمل ما وتكتسب عن طريق التدريب والقراءة والتجربة",
           "o":["خطأ","صح"],
           "a": 0
        },
        {
           "q":"من أكثر تطبيقات القدرات الحسية شيوعا الرؤية الحاسوبية",
           "o":["خطأ","صح"],
           "a": 1
        },
        {
           "q":"نظم دعم القرار بارة عن تطبيق علي الحاسب الآلي لحل المشاكل المعقدة والتي تتطلب خبرة بشرية كبيرة ويتم ذلك عن طريق محاكاة عملية الإستدلال البشرية",
           "o":["خطأ","صح"],
           "a": 0
        },





        {
           "q":"لا تعد محرك الإستدلال أو الإستنتاج جزاء رئيسي من الأنظمة الخبيرة",
           "o":["خطأ","صح"],
           "a": 0
        },
        {
           "q":"القواعد وهي التي توجه إستخدام المعرفة لحل المشكلات محددة في نطاق معين",
           "o":["خطأ","صح"],
           "a": 1
        },
        {
           "q":"محرك الإستدلال أو الإستنتاج هي الأجهزة التي تمكن من تصميم , تحديث , إستخدام والتواصل مع الخبير",
           "o":["خطأ","صح"],
           "a": 0
        },
        {
           "q":"يتم من خلال واجهة المستخدم تفسير سلوك النظام الخبير",
           "o":["خطأ","صح"],
           "a": 0
        },
        {
           "q":"الشخص الخبير الذي يعمل علي تحويل الخبرة البشرية إلي لغة يمكن برمجتها علي النظام الخبير من جهة ولغة يفهمها المستخدم النهائي للنظام",
           "o":["خطأ","صح"],
           "a": 0
        },
        {
           "q":"المستخدم النهائي هو الشخص الذي سيتولي فعليا إستخدام النظام لمساعدته في حل المشاكل التي تواجهه أو إتخاذ القرارات",
           "o":["خطأ","صح"],
           "a": 1
        },
        {
           "q":"يمثل خبير المجال الشخص القادر علي تصميم نظام الخبرة وبنائه وإختباره ويكون مسؤولا عن إختيار المهمة المناسبة للنظام",
           "o":["خطأ","صح"],
           "a": 0
        },
        {
           "q":"المبرمج يقوم بوصف معرفة خبير المجال بلغة برمجية ممكن أن يفهمها الحاسوب",
           "o":["خطأ","صح"],
           "a": 1
        },
        {
           "q":"المبرمج هو قائد فريق تطوير نظام الخبرة والمسؤول عن إستمرارية المشروع من البداية وحتي النهاية",
           "o":["خطأ","صح"],
           "a": 0
        },
        {
           "q":"من أبرز أمثلة النظم الخبيرة الداخلية نظم فحص السطوح السفلية للبناء الجيولوجي",
           "o":["خطأ","صح"],
           "a": 1
        },
        {
           "q":"تعتبر نظم الخبرة المبنية علي نموذج فيدة في تشخيص المشكلات التي تعاني منها معدات أو آلات أو أجهزة معينة",
           "o":["خطأ","صح"],
           "a": 1
        },
        {
           "q":"النظام الخبير يعالج البيانات",
           "o":["خطأ","صح"],
           "a": 0
        },
        {
           "q":"يعد من معالجة المشاكل التي لا يعرف لها خوارزمية محددة أهم خصائص النظم الخبيرة",
           "o":["خطأ","صح"],
           "a": 1
        },
        {
           "q":"تعتبر  cadhelpمن النظم الخبيرة المتوافرة لتصميم الدوائر الإلكترونية الرقمية بإستخدام الحاسب",
           "o":["خطأ","صح"],
           "a": 1
        },
        {
           "q":"تعد forest من النظم الخبيرة المتوافرة للكشف عن الأعطال بالأجهزة الإلكترونية الرقمية بإستخدام الخبرة المعملية",
           "o":["خطأ","صح"],
           "a": 1
        },
        {
           "q":"تستخدم palladio للتصميم ثلاثي الأبعاد للأجهزة الإلكترونية",
           "o":["خطأ","صح"],
           "a": 1
        },
        {
           "q":"يعتبر دندرال أول النظم الخبيرة علي الإطلاق",
           "o":["خطأ","صح"],
           "a": 1
        },
        {
           "q":"يستطيع نظام ماكسيما معاونة الكيميائيين في تحديد التركيب الجزئي للمواد غير المعروفة",
           "o":["خطأ","صح"],
           "a": 0
        },
        {
           "q":"يختص نظام ماكسيما بمعاونة الجيولوجيين في البحث عن المعادن النفيسة",
           "o":["خطأ","صح"],
           "a": 0
        },
        {
           "q":"تستعمل برامج قواعد البيانات قوانين التفكير من المنطق والحس العام وغيرها للوصول إلي نتائج عائدة إلي المعلومات المخزونة",
           "o":["خطأ","صح"],
           "a": 0
        },





        {
           "q":"تمدنا قاعدة البيانات بالنتائج النهائية المبنية علي التعليل",
           "o":["خطأ","صح"],
           "a": 1
        },
        {
           "q":"يتميز النظام الخبير بالإدراك",
           "o":["خطأ","صح"],
           "a": 0
        },
        {
           "q":"يتعذر علي النظام الخبير أن يتجاوب مع حالة غير إعتيادية",
           "o":["خطأ","صح"],
           "a": 1
        },
        {
           "q":"يتأقلم النظام الخبير مع تغير الظروف",
           "o":["خطأ","صح"],
           "a": 0
        },
        {
           "q":"يستخدم نظام دعم القرار الجماعي لحل المشاكل المهيكلة",
           "o":["خطأ","صح"],
           "a": 0
        },
        {
           "q":"تتميز نظام دعم القرار الجماعي بعدم المشاركة في قاعدة بيانات موحدة",
           "o":["خطأ","صح"],
           "a": 0
        },
        {
           "q":"تعرف النظم الخبيرة بأنها نظام حاسوبي متفاعل لتسهيل حل المشاكل بواسطة مجموعه من صانعي القرار",
           "o":["خطأ","صح"],
           "a": 1
        },
        {
           "q":"تضم GDSS نظام لإدارة الحوار",
           "o":["خطأ","صح"],
           "a": 0
        },
        {
           "q":"لا تختلف GDSS عن DSS في عتاد الحاسب المستخدم لدعم العمل الجماعي",
           "o":["خطأ","صح"],
           "a": 0
        },
        {
           "q":"تشمل البرمجيات جيمع مكونات المادية التي تعمل علي تقديم تسهيلات الإجتماع نفسه",
           "o":["خطأ","صح"],
           "a": 1
        },
        {
           "q":"تصمم نظم دعم القرارات الجماعية بغرض دعم عمليات إتخاذ القرارات أثناء صناعة القرار بغرض تحسين عوائد القرار",
           "o":["خطأ","صح"],
           "a": 1
        },
        {
           "q":"تصمم نظم دعم القرارت الجماعية بغرض دعم عمليات إتخاذ القرارات في ظل درجة عالية من التأكد",
           "o":["خطأ","صح"],
           "a": 1
        },
        {
           "q":"من الوسائل المستخدمة لصناعة القرار الجماعي غالبا تكون واحدة من وسائل العصف الذهني المشهورة",
           "o":["خطأ","صح"],
           "a": 1
        },
        {
           "q":"نظم دعم القرارات الجماعية من السهل تعلمها وإستخدامها بوساطة الأفراد بغض النظر عن مستوي معرفتهم بالحواسيب",
           "o":["خطأ","صح"],
           "a": 1
        },
        {
           "q":"نظم دعم القرارات الجماعية تصمم خصيصا لدعم القرارات التي تتخذ جماعيا",
           "o":["خطأ","صح"],
           "a": 1
        },
        {
           "q":"تحتوي نظم دعم القرارات الجماعية علي أساليب تمنع إنتشار السلوك الجماعي السلبي مثل النزاعات المدمرة",
           "o":["خطأ","صح"],
           "a": 1
        },
        {
           "q":"لا تسمح نظم دعم القرارات الجماعية التعليق علي الإقتراحات , دون الكشف عن الإسم",
           "o":["خطأ","صح"],
           "a": 0
        },
        {
           "q":"تسمح نظم دعم القرارات الجماعية للمجموعة تقديم أكبر عدد من الحلول بططريقة , غالبا عفوية , ودون ذكر للإسم",
           "o":["خطأ","صح"],
           "a": 1
        },
        {
           "q":"تسمح نظم دعم القرارات الجماعية بتصنيف الأفكار الجديد , في مجموعات متشابهة عن طريق التعديل والدمج",
           "o":["خطأ","صح"],
           "a": 1
        },
        {
           "q":"يتوجب علي النظم المعلوماتية التي تدعم نظم دعم القرارات الجماعية أن تدعيم أنشطة التخطيط طويل الأجل",
           "o":["خطأ","صح"],
           "a": 1
        },





        {
           "q":"نظم دعم القرارات الجماعية مواجهة للتغيير في البيئة الداخلية بالإعتماد علي القدرات المتاحة للمنظمة",
           "o":["خطأ","صح"],
           "a": 1
        },
        {
           "q":"تعمل نظم دعم القرارات الفردي من أجل خلق التوافق المشترك بين تكنووجيا عتاد الدعم الجماعي وتكنولوجيا نظم دعم القرار",
           "o":["خطأ","صح"],
           "a": 0
        },
        {
           "q":"لا تعتبر نظم دعم القرار الجماعي جيل متطور من نظم دعم القرار علي مستوي عتاد الحاسوب",
           "o":["خطأ","صح"],
           "a": 0
        },
        {
           "q":"إن نظام دعم القرار الجماعي نظام تفاعلي مبني علي الحاسب يستخدم لحل المشاكل غير المهيكلة",
           "o":["خطأ","صح"],
           "a": 1
        },
        {
           "q":"تعريف نظم دعم القرار الجماعي من حيث بنيتها ووظائفها بأنها : عبارة عن منظومة معلومات حاسوبية وتفاعلية , لتسهيل عملية تقديم حلول للمشكلات غير المهيكلة أو شبه المهيكلة ولدعم عمل فريق صنع القرار من المديرين وغيرهم",
           "o":["خطأ","صح"],
           "a": 1
        },
        {
           "q":"لضمان أمن المعلومات وسريتها هناك طرائق دقيقة وملائمة وموثوق منها الجدران النارية",
           "o":["خطأ","صح"],
           "a": 1
        },
        {
           "q":"البيانات عبارة عن الحقائق والأفكار التي يتبادلها الناس في حياتهم العامة عبر وسائل الإتصال",
           "o":["خطأ","صح"],
           "a": 0
        },
        {
           "q":"من مصادر المعلومات الداخلية معلومات صادرة من منظمات محلية",
           "o":["خطأ","صح"],
           "a": 0
        },
        {
           "q":"من مصادر المعلومات الخارجية المصادر الشفاهية",
           "o":["خطأ","صح"],
           "a": 0
        },
        {
           "q":"تحتل البيانات ركنا هاما في البناء الإداري المعاصر لأنها أداة الربط الأساسية بين أجزاء التنظيم",
           "o":["خطأ","صح"],
           "a": 0
        },
        {
           "q":"البيانات هي أساس أي قرار يتخذه كل مسئول في موقعه وتعتمد عليها دقة القرار وصحته",
           "o":["خطأ","صح"],
           "a": 0
        },
        {
           "q":"تعني ملائمة المعلومات أن تكون مناسبة لطلب المستفيد",
           "o":["خطأ","صح"],
           "a": 1
        },
        {
           "q":"يعني التوقيت أن تكون المعلومات مناسبة زمنيا للإستخدام خلال دورة تشغيلها",
           "o":["خطأ","صح"],
           "a": 0
        },
        {
           "q":"يعني الوضوح أن تكون المعلومات مستقلة فيما بينها دون تعارض أو تناقض",
           "o":["خطأ","صح"],
           "a": 1
        },
        {
           "q":"تعني المرونة أن تلبي المعلومات رغبات أكثر من مستفيد",
           "o":["خطأ","صح"],
           "a": 1
        },
        {
           "q":"يحتفظ بعض الموظفين الأساسيين بالمعلومات التقنية في رؤوسهم و يوثقونها",
           "o":["خطأ","صح"],
           "a": 0
        },
        {
           "q":"تعد البرمجيات والتسجيلات الصوتية والأفلام والخرائط والإعلانات مثال علي سلعة المعلومات",
           "o":["خطأ","صح"],
           "a": 1
        },
        {
           "q":"من الصعب تحديد درجة سرية معينة للمعلومات الأمنية",
           "o":["خطأ","صح"],
           "a": 0
        },
        {
           "q":"تكون حماية سلعة المعلومات بوساطة قوانين الملكية الفكرية",
           "o":["خطأ","صح"],
           "a": 1
        },
        {
           "q":"عرفت نظم المعلومات علي أنها كل السياسات و الإجرائات والأدوات التقنية التي تستخدم لحماية المعلومات من أشكال الإستخدام غير الشرعي مثل السرقة , والتغر , والتعديل , وإلحاق الضرر بالمعلومات المتعمد",
           "o":["خطأ","صح"],
           "a": 0
        },





        {
           "q":"يمكن النظر لمفهوم أمن المعلومات من وجهة نظر تقنية علي أنها هي الوسائل والأدوات والإجراءات اللازم توافرها لضمان حماية المعلومات من الإخطار الداخلية والخارجية",
           "o":["خطأ","صح"],
           "a": 1
        },
        {
           "q":"ينظر لمفهوم أمن المعلومات من وجهة نظر أكاديمية علي أنها العلم الذي يبحث في نظريات وإستراتيجيات توفر الحماية للمعلومات من المخاطر التي تهددها ومن أنشطة الإعتداء عليها",
           "o":["خطأ","صح"],
           "a": 1
        },
        {
           "q":"عرفت أمن المعلومات علي أنها عدم السماح للأشخاص غير المصرح لهم ب الإطلاع علي معلومة معينة ومن الوصول إلي تلك المعلومة",
           "o":["خطأ","صح"],
           "a": 0
        },
        {
           "q":"يقصد بأمن المعلومات إخفائها ومنع تسربها إلي أفراد غير مخول لهم الحصول عليها",
           "o":["خطأ","صح"],
           "a": 0
        },
        {
           "q":"عند الحاجة إلي تحقق أفضل من هوية الشخص تستخدم بعض الأنظمة معلومات بيولوجية عن المستخدم",
           "o":["خطأ","صح"],
           "a": 1
        },
        {
           "q":"عفت قاعدة البيانات علي أنها مجموعة من الملفات المختلفة الخاصة بنظام فرعي معين من أنظمة المنظمة أو لعدد من النظم الفرعية المتكاملة",
           "o":["خطأ","صح"],
           "a": 1
        },
        {
           "q":"البت هو أصغر عنصر منطقي يتكون من حرف , رمز , أو رقم",
           "o":["خطأ","صح"],
           "a": 0
        },
        {
           "q":"الحقل هو أصغر وحدة علي الحاسب (وحدة ثنائية) أما صفر وأما واحد",
           "o":["خطأ","صح"],
           "a": 0
        },
        {
           "q":"السجل يمثل مجموعة من الحروف المترابطة , قد تكون إسم طالب مثلآ",
           "o":["خطأ","صح"],
           "a": 0
        },
        {
           "q":"الملف هو مجموعة من الحقول المترابطة (الإسم , السن , رقم الجلوس , الفرقة)",
           "o":["خطأ","صح"],
           "a": 0
        },
        {
           "q":"الكيان هو الموضوع أو الشئ الذي يتم جمع البيانات حوله",
           "o":["خطأ","صح"],
           "a": 1
        },
        {
           "q":"الخاصة هي الصفات أو المعلومات الأساسية التي تكون هامة جدا للكيان",
           "o":["خطأ","صح"],
           "a": 1
        },
        {
           "q":"عنصر البيانات هو عنصر البيانات الأكثر تمييزا للكيان , والذي يمكن من التعرف علي السجل",
           "o":["خطأ","صح"],
           "a": 0
        },
        {
           "q":"يشير مفتاح السجل إلي القيمة المتعلقة بالخاصية فمثلا تاريخ الميلاد بالنسبة للموظف يمثل عنصر للبيانات",
           "o":["خطأ","صح"],
           "a": 0
        },
        {
           "q":"تعتمد البطاقات الذكية علي سمات معينة في شخص المستخدم",
           "o":["خطأ","صح"],
           "a": 0
        },
        {
           "q":"تشمل سمة المحتوي علي التوقيع الإلكتروني (القلم الضوئي)",
           "o":["خطأ","صح"],
           "a": 1
        },




        {
           "q":"يتضمن .......... إدارة فريق إتخاذ القرار",
           "o":["إستخبارات الأعمال","التصميم","الإختيار","التنفيذ"  ],
           "a": 2
        },
        {
           "q":"يتضمن ........... تأسيس الإتصال المناسب لتبليغ القرار",
           "o":["إستخبارات الأعمال","التصميم","الإختيار","التنفيذ"],
           "a": 3
        },
        {
           "q":"تدعم ....... القرارات التي تحدث لمرة واحدة ولا تتكرر إلا في حالة نادرة",
           "o":["النظام","نظم المعلومات الإدارية","نظم دعم القرارات","غير ذلك"],
           "a": 2
        },
        {
           "q":"تساعد ....... في عملية تخطيط السيناريوهات من خلال الإستفادة من إمكانات الإجابة عن تساؤلات : ماذا - لو",
           "o":["النظام","نظم المعلومات الإدارية","نظم دعم القرارات","غير ذلك"],
           "a": 2
        },
        {
           "q":"تعني القرارات ......... بتحديد برامج العمل المستتقبلي للمؤسسة",
           "o":["الإستراتيجية","الإدارية","التشغيلية","غير ذلك"],
           "a": 0
        },
        {
           "q":"تتعلق القرارات ........... بالوضع التنافسي للمؤسسة في السوق",
           "o":["الإستراتيجية","الإدارية","التشغيلية","غير ذلك"],
           "a": 0
        },
        {
           "q":"تتصف القرارات ...... بدرجة عالية من المركزية في إتخاذها",
           "o":["الإستراتيجية","الإدارية","التشغيلية","غير ذلك"],
           "a": 0
        },
        {
           "q":"تؤخذ القرارات ....... عند قمة الهيكل التنظيمي بواسطة الإدارة العليا",
           "o":["الإستراتيجية","الإدارية","التشغيلية","غير ذلك"],
           "a": 0
        },
        {
           "q":"القرارات ....... يتخذها الرؤساء أو الإدارات أو ما يسمي بالإدارة الوسطي",
           "o":["الإستراتيجية","الإدارية","التشغيلية","غير ذلك"],
           "a": 1
        },
        {
           "q":"غالبآ ما تهدف القرارات ....... إلي تقرير الوسائل المناسبة لتحقيق الأهداف",
           "o":["الإستراتيجية","الإدارية","التشغيلية","غير ذلك"],
           "a": 1
        },
        {
           "q":"هو ذلك الفرع من علوم الحاسوب الذي يمكن بواسطته خلق وتصميم برامج الحاسبات .........ا",
           "o":["نظم المعلومات الإدارية","نظم دعم القرار","الذكاء الصطناعي","النظم الخبيرة"],
           "a": 2
        },
        {
           "q":"أنه جزء من علم الحاسبات الذي يهتم بأنظمة الحاسوب الذكية .........ا",
           "o":["نظم المعلومات الإدارية","نظم دعم القرار","الذكاء الإنساني","النظم الخبيرة"],
           "a": 2
        },
        {
           "q":"للذكاء الإصطناعي نوعين من الوظائف يتضمن النوع الأول",
           "o":["اللغة الطبيعية","التخطيط","الحركة","جميع ما سبق"],
           "a": 3
        },
        {
           "q":"للذكاء الإصطناعي نوعين من الوظائف يتضمن النوع الثاني",
           "o":["التشخيص الطبي","صيانة الأجهزة","التخطيط المالي","جميع ما سبق"],
           "a": 3
        },
        {
           "q":"للذكاء الأصطناعي نوعين من الوظائف والتي منها",
           "o":["وظائف حياتيه ذكية","الوظائف الخبيرة","أ,ب معآ","غير ذلك"],
           "a": 2
        },
        {
           "q":"يعد ........ من تطبيقات الذكاء الإصطناعي العامة",
           "o":["لعب الشطرنج","التشخيص الطبي","أ,ب معآ","غير ذلك"],
           "a": 3
        },
        {
           "q":"يعتبر ........ من تطبيقات الذكاء الإصطناعي الخاصة",
           "o":["الإدراك","التعليل المنطقي","أ,ب معآ","غير ذلك"],
           "a": 3
        },
        {
           "q":"تعتمد ....... علي قاعدة معرفة تمثل خبرة إنسان خبير في المجال المحدد",
           "o":["النظم الخبيرة","الشبكة العصبونية","الذكاء الصطناعي","غير ذلك"],
           "a": 0
        },
        {
           "q":"تطبق ........ في مجال محدد مثل : التعرف علي الأشكال",
           "o":["النظم الخبيرة","الشبكة العصبونية","الذكاء الصطناعي","غير ذلك"],
           "a": 1
        },
        {
           "q":"يتعلق ....... ببرمجة الحواسيب ويرتبط هذا المجال بحقل التعرف علي الكلام",
           "o":["النظم الخبيرة","الشبكة العصبونية","الذكاء الصطناعي","غير ذلك"],
           "a": 3
        },
        {
           "q":"يعرف ....... بأنه طريقة محددة يمكن تباعها بإستمرار لإنجاز عمل أو أداء مهمة معينة",
           "o":["النظم الخبيرة","الشبكة العصبونية","الذكاء الصطناعي","غير ذلك"],
           "a": 3
        },
        {
           "q":"عرفة ........... بأنهها المعرفة الواسعة المحددة لمهمة أو عمل ما وتكتسب عن طريق التدريب والقراءة والتجربة",
           "o":["النظم الخبيرة","الشبكة العصبونية","الذكاء الصطناعي","غير ذلك"],
           "a": 3
        },
        {
           "q":"عبارة عن أنظمة قادرة علي تقديم حلول لمشاكل معينة في مجال معين ......... ا",
           "o":["الشخص الخبير","مهندس المعرفة","واجهة المستخدم","غير ذلك"],
           "a": 0
        },
        {
           "q":"يتم عن طريق ........ محاكاة عملية الإستدلال البشرية",
           "o":["النظم الخبيرة","الشبكة العصبونية","الذكاء الصطناعي","غير ذلك"],
           "a": 0
        },
        {
           "q":"يوجد خمسة أجزاء رئيسية تتكون منها الأنظمة الخبيرة  والتي منها",
           "o":["قاعدة المعرفة","محرك الإستدلال","واجهة المستخدم","جميع ما سبق"],
           "a": 3
        },
        {
           "q":"يعتبر ...... من الأجزاء الرئيسية التي تتكون منها الأنظمة الخبيرة",
           "o":["محرك الإستنتاج","وحدة التوضيح","واجهة المستخدم","جميع ما سبق"],
           "a": 3
        },
        {
           "q":"هي التي توجه إستخدام المعرفة لحل مشكلات محددة في نطاق معين ......... ا",
           "o":["الحقائق","وحدة التوضيح","وسيلة الإستحواذ علي المعرفة","جميع ما سبق"],
           "a": 2
        },
        {
           "q":"تستخدم ....... البيانات التي يتم الحصول عليها من قاعدة المعرفة",
           "o":["محرك الإستنتاج","وحدة التوضيح","القواعد","غير ذلك"],
           "a": 0
        },
        {
           "q":"هي الأجهزة التي تمكن من تصميم,حديث,إستخدام والتواصل مع الخبير .........ا",
           "o":["محرك الإستنتاج","وحدة التوضيح","وسيلة الإستحواذ علي المعرفة","غير ذلك"],
           "a": 2
        },
        {
           "q":"يتم من خلال ....... تفسير سلوك النظام الخبير",
           "o":["محرك الإستنتاج","وحدة التوضيح","واجهة المستخدم","غير ذلك"],
           "a": 1
        },
        {
           "q":"يعمل ....... علي تحويل الخبرة البشرية إلي لغة يمكن برمجتها علي النظام الخبير من جهة ولغة يفهمها المستخدم النظام",
           "o":["الشخص الخبير","مهندس المعرفة","المبرمج","غير ذلك"],
           "a": 1
        },
        {
           "q":"هو ....... الشخص القادر علي تصميم نظام الخبرة وبنائه وإختباره ويكون مسؤولا عن إختيار المهمة المناسبة للنظام",
           "o":["الشخص الخبير","مهندس المعرفة","خبير المجال","مهندس المعرفة"],
           "a": 3
        },




        {
           "q":"هو مجموعة من الأفراد والبيانات والإجراءات المترابطة مع بعضها البعض لتقديم معلومات مفيدة........ ا",
           "o":["النظم","نظام المعلومات الإدارية","نظم دعم وإتخاذ القرار","غير ذلك"],
           "a": 1
        },
        {
           "q":"يتكون نظام المعلومات المعلومات الإدارية من",
           "o":["الحاسب","الأفراد","البرمجيات","جميع ما سبق"],
           "a": 3
        },
        {
           "q":"تهدف نظم المعلومات الإدارية إلي",
           "o":["إنجاز الأعمال","تدعيم ومساندة الوظائف الإدارية","إتخاذ القرارات","جميع ما سبق"],
           "a": 3
        },
        {
           "q":"مرحلة ...... هي مرحلة الخمسينات وجزء من الستينات",
           "o":["التركيز علي البيانات","التركيز علي المعلومات","التركيز علي إتخاذ القرارات","تركيز علي الإتصالات"],
           "a": 0
        },
        {
           "q":"هي هي المرحله التي تركز على ان الحاسب قادر على اشياء اكثر بكثير من تشغيل البيانات.......ا",
           "o":["التركيز علي البيانات","التركيز علي المعلومات","تركيز علي الإتصالات","غير ذلك"],
           "a": 0
        },
        {
           "q":"زادت أهمية نظم المعلومات الإدارية للعديد من الأسباب منها",
           "o":["نمو المنظمات في حجمها","زيادة درجة التخصص في أعمال","زيادة الإهتمام بنظم التغذية العكسية","جميع ما سبق"],
           "a": 3
        },
        {
           "q":"تساعد نظم المعلومات الإدارية المنظمات في",
           "o":["خلق المنتجات","فتح اسواق جديدة","تخفيض التكلفة","جميع ما سبق"],
           "a": 3
        },
        {
           "q":"تكمن أهمية نظم المعلومات الإدارية الأنشطة الأنشطة الأساسية مثل ......... ا",
           "o":["نظام لتدفق العمل التعاوني","إدارة الموارد البشرية","أ,ب معآ","جميع ما سبق"],
           "a": 3
        },
        {
           "q":"يمكن تحديد دور نظام المعلومات في المنظمة من خلال وجهتي نظر مختلفتين حيث تركز وجهة النظر الأولي علي ..........ا",
           "o":["دور تقنية المعلومات للحاسب","علي الفرص التي يمكن الإستفادة منها","أ,ب معآ","غير ذلك"],
           "a": 0
        },
        {
           "q":"تكمن أهمية نظم المعلومات الإدارية في",
           "o":["تقديم المعلومات إلي المستوي","تقديم المعلومات إلي الأقسام المختلفة","تقييم النتائج والنشطات في المنظمة","جميع ما سبق"],
           "a": 3
        },
        {
           "q":"يحقق نظم المعلومات الإدارية فوائد بالنسبه للعملية الإدارية تساعد في",
           "o":["تجميع البيانات","تقدم للإدارة تمثيلا من","تخرج القرارات بقدر كبير من التأكد","جميع ما سبق"],
           "a": 3
        },
        {
           "q":"توفير نظم المعلومات الإدارية المعلومات الملائمه لأغراض",
           "o":["المتابعة","الرقابة","قياس الأداء","جميع ما سبق"],
           "a": 3
        },
        {
           "q":"يعد ........ من وظائف المعلومات الإدارية",
           "o":["جمع البيانات","معالجة البيانات","إسترجاع المعلومات","جميع ما سبق"],
           "a": 3
        },
        {
           "q":"هي تحويل البيانات من هيئتها الأولية إلي معلومات ذات معني وقيمة .........ا",
           "o":["جمع البيانات","تخزين المعلومات","إسترجاع المعلومات","غير ذلك"],
           "a": 3
        },
        {
           "q":"هي العملية الخاصة بإسترجاع المعلومات التي تم تخزينها عند ظهور حاجة المستفيد إليها ...........ا",
           "o":["جمع البيانات","تخزين المعلومات","معالجة البيانات","غير ذلك"],
           "a": 3
        },
        {
           "q":"يهدف النظام إلي المساعدة في صنع القرارات",
           "o":["المبرمجة","الغير مبرمجة","أ,ب معآ","غير ذلك"],
           "a": 2
        },
        {
           "q":"تعد نظم المعلومات الإدارية نظم",
           "o":["نظم مفتوحة","نظم مغلقة","أ,ب معآ","غير ذلك"],
           "a": 0
        },
        {
           "q":"تعتبر نظم المعلومات الإدارية هي نظم",
           "o":["مفتوحة","إقتصادية","إنسانية","غير ذلك"],
           "a": 3
        },
        {
           "q":"هي الشكل الظاهري لمجموعة حقائق غير منظمة ..........ا",
           "o":["المعلومات","البيانات","المعرفة","غير ذلك"],
           "a": 1
        },
        {
           "q":"لا تعطي ......... معني وهي منفردة",
           "o":["المعلومات","البيانات","المعرفة","غير ذلك"],
           "a": 1
        },
        {
           "q":"هي الشئ الذي يغير الحالة المعرفية للشخص في موضوع ما , أو مجال ما ............ا",
           "o":["المعلومات","البيانات","المعرفة","غير ذلك"],
           "a": 0
        },
        {
           "q":"هي الفهم المكتسب من خلال الخبرات والدراسة , وقد تكون حقائق تراكمية , أو قواعد إجرائية , أو توجيهات ............ا",
           "o":["المعلومات","البيانات","المعرفة","غير ذلك"],
           "a": 2
        },
        {
           "q":"هي مزيج من المفاهيم والأفكار والقواعد و الإجراءات التي تهدي الأفعال والقرارات ..........ا",
           "o":["المعلومات","البيانات","المعرفة","غير ذلك"],
           "a": 2
        },
        {
           "q":"تعني ........ إحتواء المعلومات المتوفرة للحقائق الأساسية التي يحتاجها المدير لإتخاذ القرا",
           "o":["المعلومات","البيانات","المعرفة","غير ذلك"],
           "a": 3
        },{
           "q":"يتضمن ...... تامين البدائل وتقييم المخرجات",
           "o":["الشمول","الشمول","عدم التحيز","غير ذلك"],
           "a": 3
        },
        {
           "q":"هي مجموعه من الاجزاء التي تتفاعل وتتكامل مع بعضها البعض  ومع ببلتها لتحقيق هدف او اهداف معينه………..",
           "o":["الدقه","الشمول","الملائمه","غير ذلك"],
           "a": 3
        },
        {
           "q":"هي مجموعه ذات طابع انتظامي لمكونات مستقله مرتبطه ومتكامله ولكنها تعتمد على بعضها البعض من اجل ……….",
           "o":["الدقه","الشمول","الملائمه","غير ذلك"],
           "a": 3
        },
        {
           "q":"تتمثل…… الموارد اللازمه للنظام ليتمكن من القيام بالانشطه المختلفه لتحقيق الاهداف",
           "o":["المدخلات","العمليات","المخرجات","غير ذلك"],
           "a": 0
        },
        {
           "q":"تشمل….. العديد من العناصر الغير متجانسه كالبيانات والالات",
           "o":["المدخلات","العمليات","المخرجات","غير ذلك"],
           "a": 0
        },
        {
           "q":"تعد…… الاداء التي من خلالها يتم التحقق من اداء النظام وقدرته على تحقيق اهدافه",
           "o":["المدخلات","العمليات","المخرجات","غير ذلك"],
           "a": 2
        },
        {
           "q":"تعتبر…… اداه لتحقيق الرقابه على اداء النظام",
           "o":["معلومات مرتده تطويريه","معلومات مرتده تصحيحيه","معلومات مرتده معرفيه","ا و ب معا"],
           "a": 3
        },
        {
           "q":"تعمل المعلومات المرتده….. على تغيير الاهداف",
           "o":["التطويريه","التصحيحيه","المعرفيه","ا و ب معا"],
           "a": 0
        },
        {
           "q":"تمثل ….. الوسيله التي من خلالها يتم ربط  النظم الفرعيه  ببعضها البعض وايضا ربط النظام ببيئته",
           "o":["العلاقات","النظم","حدود النظام","ا و ب معا"],
           "a": 0
        },
        {
           "q":"هي التي لا يمكن لمسها وانما يمكن تصورها عقليا مثل نظام المعادلات الجبريه…..",
           "o":["النظام المفتوح","النظام المغلق","النظم المحسوسه","لنظم المجرده"],
           "a": 3
        },
        {
           "q":"مسار يختاه  المقرر باعتباره انسب وسيله متاحه لانجاز الهدف او الاهداف التي يبتغيها لحل المشكله التشغيليه……",
           "o":["النظام المفتوح","النظام المغلق","النظم المحسوسه","غير ذلك"],
           "a": 3
        },
        {
           "q":"هو عمليه عقلانيه تتبلور في الاختيار بين بدائل متعدده ذات المواصفات تتناسب مع الامكانيات المتاحه والاهداف ……",
           "o":["الاختبار","المفاضله","القرار","القرار"],
           "a": 2
        },
        {
           "q":"تتسم عمليه اتخاذ القرار بانها",
           "o":["عمليه ذهنيه","مليه اجرائيه","ايجاد مجموعه من البدائل","جميع ما سبق"],
           "a": 3
        },
        {
           "q":"يتخذ المديرون والقاده فيه……  العديد من القرارات التي تكون مبرمجه وروتينيه",
           "o":["المستوى  الدنيا","الاداره الوسطى","الاداره العليا","غير ذلك"],
           "a": 0
        },
        {
           "q":"تتسم القرارات في ………  بانها غير مبرمجه ولا تكون بصفه متكرره",
           "o":["المستوى  الدنيا","الاداره الوسطى","الاداره العليا","غير ذلك"],
           "a": 1
        },
        {
           "q":"تتميز القرارات في…….  بانها استراتيجيه تتعلق بنشاط ومستقبل المنظمه",
           "o":["الاداره الاشرافيه","الاداره التشغيليه","الاداره الوسطى","غير ذلك"],
           "a": 3
        },
        {
           "q":"هو مجموعه منتظمه من الاجزاء او النظم الفرعيه المرتبطه ومتفاعله فيما بينها …………",
           "o":["النظام","النظام المعلومات الاداريه","نظم دعم القرارات","غير ذلك"],
           "a": 0
        },
        {
           "q":"تهيئ…….  للمديرين اساليب التحليل",
           "o":["النظام","نظم المعلومات الاداريه","نظم دعم القرارات","غير ذلك"],
           "a": 2
        },
        {
           "q":"هو البديل الامثل الذي يمثل حل المشكله موضوع الاهتمام بمعنى ان المسانده بجميع اشكالها تهدف لاتخاذ القرار………",
           "o":["النظام","نظم المعلومات الاداريه","نظم دعم القرارات","غير ذلك"],
           "a": 3
        },
        {
           "q":"نظم المعلومات الاداريه لها فوائد كثيره منها",
           "o":["تدعم عمليه اتخاذ القرارات","تحسن السيطره الاداريه","تساعد المديرين في فصل اماكن","غير ذلك"],
           "a": 3
        },
        {
           "q":"يمكن تحديد اهداف  يجب ان  تحققها  نظام دعم القرارات في :ا",
           "o":["مساعده المدراء لحل المشكلات","دعم قرارات المدراء بدلا من تغييرها","تحسين فعاليه القرارات","جميع ما سبق"],
           "a": 3
        },
        {
           "q":"يتضمن……….   جمع وتحليل البيانات المرتبطه بالمشكلات المحدده",
           "o":["استخبارات الاعمال","التصميم","الاختيار","التنفيذ"],
           "a": 0
        },
        {
           "q":"يتضمن…….  ايجاد نماذج مناسبه لتنظيم النتائج",
           "o":["استخبارات الاعمال","التصميم","الاختيار","التنفيذ"],
           "a": 1
        },
        {
           "q":"يتضمن……..   تامين البدائل وتقييم المخرجات",
           "o":["استخبارات الاعمال","التصميم","الاختيار","التنفيذ"],
           "a": 1
        }
    ] 
}
