{
    "data" :
    [
        {
            "q": "هي مجموعه من الافراد والبيانات والاجراءات المرتبطة مع بعضها البعض لتقديم معلومات مفيده",
            "a" : "نظم المعلومات "
        },
        {
            "q": "هي نوع من انواع انظمة المعلومات المصممة لتزويد ادارة المنظمة بالمعلومات",
            "a": "نظم المعلومات الإدارية"
        },
        {
            "q": "يتكون نظام المعلومات من",
            "a": "حاسب آلي & أفراد & برمجيات"
        },
        {
            "q": "هي مرحلة الخمسينات وجزء من التسعينات",
            "a": "مرحلة التركيز علي البيانات"
        },
        {
            "q": "هي المرحله التي تركز علي ان الحاسب قادر علي أشياء أكثر بكثير من تشغيل البيانات",
            "a": "التركيز علي المعلومات"
        },
        {
            "q": "ذادت أهمية نظم المعلومات الإدارية للعديد من الأسباب منها",
            "a": "نظم المعلومات وحجمها & وزيادة درجة التخصص ف العمل بالمنظمات"
        },
        {
            "q": "تساعد نظم المعلومات الادارية المنظمات في",
            "a": "تخفيض التكفة وفتح اسواق جديدة وخلق المنتجات"
        },
        {
            "q": "ترجع اهمية نظم المعلومات الادارية في مساندة الانشطة الاساسية",
            "a": ""
        },
        {
            "q": "يمكن تحديد دور المنظمات من خلال وجهتين نظر مختلفتين حيث تركز وجهة النظر الاولي علي",
            "a": "دور تقنية معلومات الحاسبت"
        },
        {
            "q": "هي الشكل الظاهري لمجموعة حقائق غير منظمة",
            "a": "البيانات"
        },
        {
            "q": "لا تعطي معني وهي منفردة",
            "a": "البيانات"
        },
        {
            "q": "هي الشئ الذي يغير الحالة المعرفية للشخص في موضوع أو مجال",
            "a": "المعلومات"
        },
        {
            "q": "هي الفهم المكتسب من خلال الخبرات والدراسة وقد تكون حقائق تراكمية أو قواعد إجرائية أو توجيهات",
            "a": "المعرفة"
        },
        {
            "q": "هي مزيج من المفاهيم والأفكار والقواعد والإجراءات اتي تهدي الأفعال والقرارات",
            "a": "المعرفة"
        },
        {
            "q": "تعني ....... إحتواء المعلومات المتوفرة للحقائق الأساسيةالتي يحتاجها المدير لإتخاذ القرارات",
            "a": "الشمول"
        },
        {
            "q": "هي تلك المعلومات التي توافق أو تطابق إحتياجات المدير متخذ القرار ",
            "a": "الملائمة"
        },
        {
            "q": "هي مجموعة ذات طابع إنتظامي لمكونات مستقلة مترابطة ومتكاملة ولكنها تعتمد علي بعضها البعض من أجل تحقيق الأهداف المشتركة",
            "a": "النظم"
        },
        {
            "q": "تمثل .......... المواد الللازمة للنظام ليتمكن من القيام بالأنشطة المختلفة لتحقيق الأهداف",
            "a": "المدخلات"
        },
        {
            "q": "مجموعة متكاملة من البرمجيات والحزم الجاهزه والنماذج وأدوات المعالجة تتفاعل مع البيانات والمعلومات لتقديم الحلول المقترحة",
            "a": "نظم دعم القرار"
        },
        {
            "q": "تهئ ............... للمدير أساليب التحليل",
            "a": "نظم دعم القرار"
        },
        {
            "q": "يمكن تحدد أهداف يجب أن يحققها نظام دعم القرارت في",
            "a": " مساعدة المدراء لحل المشكلات شبه المهيكله & دعم القرارات بدل من تغييرها & وتحسين فاعلية إتخاذ القرارات وليس لحفظها فقط"
        },
        {
            "q": "يتضمن ........ جمع وتحيل البيانات المرتبطةبالمشكلات المحددة",
            "a": "إستخبارات الأعمال"
        },
        {
            "q": "يتضمن ....... جمع وتحليل البيانات المترابطة بالمشكلات المحددة",
            "a": "التصميم"
        },
        {
            "q": "يتضمن ........ تقييم البدائل وتقييم المخرجات",
            "a": "التصميم"
        },
        {
            "q": "هو ذلك الفرع من علوم الحاسوب الذي يمكن بواسطته خلق وتصميم برامج الحاسب الآلي",
            "a": "الذكاء الأصطناعي"
        },{
            "q": "هو جزء من علم الحاسبات الذي يهتم بأنظمة الحاسوب الذكية",
            "a": "الذكاء الإنساني"
        },
        {
            "q": "الذكاء الأصطناعي نوعين من الوظائف يتضمن النوع الأول",
            "a": "لغة الطبيعة & التخطيط & الحركة"
        },
        {
            "q": "هي أصغر وحدة للحاسب",
            "a": "البت"
        },
        {
            "q": "يعتبر من تطبيقات الذكاء الأصطناعي الخاص",
            "a": ""
        },
        {
            "q": "تطبق ...... في مجال محدد مثل التعرف علي الأشكال ",
            "a": "الشبكات العصبونية"
        },
        {
            "q": "تعتمد ...... علي قاعدة معرفة تمثل خبرة الإنسان في مجال محدد",
            "a": "النظم الخبيرة"
        },
        {
            "q": "معظم نظم دعم القرار المستخدمة حاليا قد صممت بالأصل لدعم القرار",
            "a": "الفردية"
        },
        {
            "q": "تستخدم نظم دعم القرار الجماعي لحل المشاكل",
            "a": "غير المهيكلة"
        },
        {
            "q": "و.......... نظام تفاعلي مبني علي الحاسب يدعم مجموعة من الناس يتشاركون في مهمة واحدة",
            "a": "نظم دعم القرار الجماعي"
        },
        {
            "q": "ما يميز نظم دعم القرار الجماعي هو المشاركة في",
            "a": "قاعدة البيانات"
        },
        {
            "q": "تحتوي نظم دعم إإتخاذ القرار الجماعي علي",
            "a": "أجهزة & برمجيات & أفراد"
        },
        {
            "q": "تعني ....... أن تكون المعلومات بالصورة الصحيحة خالية من أي أخطاء",
            "a": "الدقة"
        },
        {
            "q": "أن تكون المعلومات مستقلة فيما بينها دون تعارض أو تناقض",
            "a": "الوضوح"
        },
        {
            "q": "تعني أن تكون المعلومات مناسبة ويمكن إستخدامها في تلبية رغبات أكثر من مستفيد",
            "a": "المرونة"
        },
        {
            "q": "يمكن النظر لمفهوم الأمن والمعلومات من زوايا ......... علي أنه الوسائل والأدوات والإجرائات اللازم توافرها لضمان حماية المعلومات من الأخطاء الداخلية والخارجية",
            "a": "تقنية"
        },
        {
            "q": "عرفت ............... علي أنها عدم السماح بلأشخاص غير المسرح لهم بالإطلاع علي ملومة معينة والوصول إل تلك المععلومات",
            "a": "سرية الملومات *"
        },
        {
            "q": "هي مجموعة من الحقول المترابطة (الإسم,السن,الرقم)",
            "a": "السجل"
        },
        {
            "q": "الصفات أو المعلومات الأساسية التي تكون هامةجدا للكيان",
            "a": "الخاصية"
        },
        {
            "q": "يشير إلي القيمة المتلقة بالخاصية",
            "a": "عنصر البيانات"
        },
        {
            "q": "يمثل ....... مجموعة من الحروف المترابطة قد تكون إسم طالب",
            "a": "الحقل"
        },
        {
            "q": "أصغر عنصر منطقي يتكون من حرف أو رمز أأو رقم",
            "a": "البايت"
        },
        {
            "q": "تعني أن تكون المعلومات مناسبة لطلب المستفيد",
            "a": "الدقة"
        },
        {
            "q": "الذكاءالأصطناعي نوعين من الوظائف التي منها",
            "a": "وظائف & حياتية & ذكية"
        },
        {
            "q": "هي نظام حاسوبي متفاعل لتسهيل حل المشاكل بواسطة مجموعه من صانعي القرار",
            "a": "نظم دعم القرار الجماعي"
        },
        {
            "q": "يبني ............ بناء علي حاجة المستفيدين الفعلية مع ملاحظة التغيرات البيئية التي يتعامل معها ",
            "a": "دعم القرار"
        }
    ]
}